{
    "language": "en",
    "news": [
        {
            "title": "Who were the Iranian commanders killed in Israel's attack?",
            "summary": "Among the military figures killed is Mohammad Bagheri, the highest-ranking officer in Iran.",
            "link": "https://www.bbc.com/news/articles/c2lk5j18k4vo",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 16:26:09 GMT"
        },
        {
            "title": "Iran is reeling from Israel's unprecedented attack - and it is only the start",
            "summary": "Israel's Operation Rising Lion is more extensive and ambitious than anything that has come before, including the missile exchanges it had with Iran last year",
            "link": "https://www.bbc.com/news/articles/cvg72ny4xeyo",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 15:59:59 GMT"
        },
        {
            "title": "What satellite imagery and verified video tell us about the Israeli strikes on Iran",
            "summary": "Israel's wave of strikes against Iran, which began on Thursday night, has continued through today.  BBC Verify's Merlyn Thomas has been examining footage of the attacks and the damage they've caused.",
            "link": "https://www.bbc.com/news/videos/c04eweg57geo",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 17:42:05 GMT"
        },
        {
            "title": "Trump struggles with Iran message as Republicans diverge over attack",
            "summary": "A US president who vowed to be a peacemaker has to handle a new Middle East crisis that strikes a blow to his diplomatic efforts.",
            "link": "https://www.bbc.com/news/articles/cq69e7nr9m5o",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 16:25:54 GMT"
        },
        {
            "title": "Watch: Israel strikes targets across Iran as leaders vow to fight",
            "summary": "Israel's prime minister said Iran's nuclear capability posed a \"clear and present danger\", while Iran's president promised a \"powerful\" response.",
            "link": "https://www.bbc.com/news/videos/czdy9nj73l8o",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 14:12:14 GMT"
        },
        {
            "title": "Grooming gang guilty of raping and abusing girls",
            "summary": "Seven men are convicted of sex offences against two girls in Rochdale between 2001 and 2006.",
            "link": "https://www.bbc.com/news/articles/cdd2rld9mj2o",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 16:01:17 GMT"
        },
        {
            "title": "Black box found at Air India crash site as families wait for answers",
            "summary": "Doctors are relying on DNA from relatives to identify victims' remains, and warn the process will be slow.",
            "link": "https://www.bbc.com/news/articles/cjwqjv09q7xo",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 16:45:38 GMT"
        },
        {
            "title": "Student missed Air India flight by minutes after getting stuck in traffic",
            "summary": "Bhoomi Chauhan was running late and airline staff wouldn't let her board Air India flight 171.",
            "link": "https://www.bbc.com/news/articles/cvgv26zz5wzo",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 11:31:29 GMT"
        },
        {
            "title": "'I walked out of rubble': British survivor on how he escaped wreckage",
            "summary": "Mr Ramesh said he saw cabin crew members and passengers dying in front of his eyes.",
            "link": "https://www.bbc.com/news/articles/cd901xn4001o",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 14:26:07 GMT"
        },
        {
            "title": "Two men jailed for £4.8m gold toilet heist",
            "summary": "Five thieves were seen on CCTV stealing the fully functional toilet from Blenheim Palace in 2019.",
            "link": "https://www.bbc.com/news/articles/cgeg39vr3j3o",
            "source": "BBC News",
            "publication_date": "Fri, 13 Jun 2025 17:05:51 GMT"
        }
    ]
}