{
    "language": "en",
    "news": [
        {
            "title": "What eyewitness videos tell us about the Liverpool crash",
            "summary": "BBC Verify examines videos of the incident in which a car drove into a crowd during Liverpool FC's parade on Monday.",
            "link": "https://www.bbc.com/news/videos/c9dq6jj0l9do",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 12:24:32 GMT"
        },
        {
            "title": "Why police released details about Liverpool crash suspect so quickly",
            "summary": "The decision shows lessons have been learned from the Southport attacks last summer, writes Daniel Sandford.",
            "link": "https://www.bbc.com/news/articles/cvgv4ddpyddo",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 10:52:19 GMT"
        },
        {
            "title": "Young actors revealed for Harry Potter TV series",
            "summary": "An open casting call for the roles was announced last year and more than 30,000 children auditioned.",
            "link": "https://www.bbc.com/news/articles/c5ygp0908g9o",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 16:20:01 GMT"
        },
        {
            "title": "Farage pledges more tax breaks for married couples to make having children easier",
            "summary": "Reform leader backs lifting the two-child benefit cap and introducing more generous tax breaks for married people.",
            "link": "https://www.bbc.com/news/articles/c5yx062pvlvo",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 16:33:39 GMT"
        },
        {
            "title": "Hundreds of lawyers call for UK sanctions on Israel over Gaza war",
            "summary": "Their letter warns of genocide in Gaza, and calls on the UK to take concrete actions to meet its international legal obligations.",
            "link": "https://www.bbc.com/news/articles/cx274gj54xpo",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 17:22:57 GMT"
        },
        {
            "title": "Mary Earps announces shock England retirement before Euro 2025",
            "summary": "England goalkeeper Mary Earps announces her retirement from international football with immediate effect - just five weeks before Euro 2025 begins.",
            "link": "https://www.bbc.com/sport/football/articles/cdj9ryd8mgro",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 12:08:15 GMT"
        },
        {
            "title": "IMF raises UK growth forecast as it warns on tax and spending",
            "summary": "In its annual health-check for the UK economy, the IMF predicted growth of 1.2%, a marginal upgrade to its previous forecast.",
            "link": "https://www.bbc.com/news/articles/cx2jy0jk231o",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 15:50:46 GMT"
        },
        {
            "title": "Drug-fuelled driver who caused death of three-year-old girl jailed",
            "summary": "Rawal Rehman is jailed for 12 years after his van hit and killed Louisa Palmisano in Manchester.",
            "link": "https://www.bbc.com/news/articles/cp3qdj0qdp7o",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 13:34:59 GMT"
        },
        {
            "title": "Bournemouth beach huts destroyed in overnight fire",
            "summary": "Crews fought the fire on East Beach, Undercliff Drive, on the Bournemouth seafront.",
            "link": "https://www.bbc.com/news/articles/ckgn4y4n0vno",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 14:11:30 GMT"
        },
        {
            "title": "Ancient human fingerprint suggests Neanderthals made art",
            "summary": "A Neanderthal man is believed to have painted a nose on a pebble using red pigment more than 43,000 years ago.",
            "link": "https://www.bbc.com/news/articles/cn0g9jv707yo",
            "source": "BBC News",
            "publication_date": "Tue, 27 May 2025 14:45:18 GMT"
        }
    ]
}