{"language": "en", "news": [{"title": "JOSH TRAVIS Isn't Even Sure Of His Role In THE TONY DANZA TAPDANCE EXTRAVAGANZA", "summary": "Josh Travis kept repeating the question, \"What is my status?\" as if he was unsure of whether or not he's still the band's guitarist himself. \n The post  JOSH TRAVIS Isn't Even Sure Of His Role In THE TONY DANZA TAPDANCE EXTRAVAGANZA  appeared first on  Metal Injection .", "link": "https://metalinjection.net/news/josh-travis-isnt-even-sure-of-his-role-in-the-tony-danza-tapdance-extravaganza", "source": "Metal Injection", "publication_date": "Mon, 08 Dec 2025 17:41:42 +0000"}, {"title": "AVENGED SEVENFOLD Announces Co-Headlining Tour In North America Alongside GOOD CHARLOTTE", "summary": "Avenged Sevenfold have just announced a brand new co-headlining tour in 2026 alongside longtime friends, Good Charlotte. \n The post  AVENGED SEVENFOLD Announces Co-Headlining Tour In North America Alongside GOOD CHARLOTTE  appeared first on  Metal Injection .", "link": "https://metalinjection.net/tour-dates/avenged-sevenfold-announces-co-headlining-tour-in-north-america-alongside-good-charlotte", "source": "Metal Injection", "publication_date": "Mon, 08 Dec 2025 16:36:38 +0000"}, {"title": "BEN KOLLER of CONVERGE Involved In Hit-And-Run That Rolled His Car Over; Says He's \"Pretty Lucky To Be Alive\"", "summary": "The drummer for Converge was involved in a non-fatal t-bone car accident in which his car was flipped by the impacting vehicle. \n The post  BEN KOLLER of CONVERGE Involved In Hit-And-Run That Rolled His Car Over; Says He's \"Pretty Lucky To Be Alive\"  appeared first on  Metal Injection .", "link": "https://metalinjection.net/news/ben-koller-of-converge-involved-in-hit-and-run-that-rolled-his-car-over", "source": "Metal Injection", "publication_date": "Mon, 08 Dec 2025 15:47:47 +0000"}, {"title": "GODSMACK Announces European Shows With NOTHING MORE & THUNDER MOTHER", "summary": "Happening next July and August. \n The post  GODSMACK Announces European Shows With NOTHING MORE & THUNDER MOTHER  appeared first on  Metal Injection .", "link": "https://metalinjection.net/tour-dates/godsmack-announces-european-shows-with-nothing-more-thunder-mother", "source": "Metal Injection", "publication_date": "Mon, 08 Dec 2025 14:27:09 +0000"}]}