[
    {
        "title": "British couple held in Iran named as family urge safe return",
        "summary": "Craig and Lindsay Foreman were travelling through Iran as part of a motorbike trip across the world. The pair were on a trip to see the world on their motorbikes.",
        "link": "https://www.bbc.com/news/articles/c626p6pz7xlo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 15:58:51 GMT"
    },
    {
        "title": "'Army of Europe' needed to challenge Russia, says Zelensky",
        "summary": "The Ukraine president suggests Europe can no longer rely on the US to come to its defence. The Ukraine president says the US is no longer the only country that can defend Europe.",
        "link": "https://www.bbc.com/news/articles/cvgl27x74wpo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 13:06:54 GMT"
    },
    {
        "title": "Woman killed in Valentine's Day pub shooting",
        "summary": "The woman, in her 40s, was shot outside the Three Horseshoes pub in Knockholt. She was pronounced dead at the scene on Friday evening.",
        "link": "https://www.bbc.com/news/articles/c75z2374qzno",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 17:09:29 GMT"
    },
    {
        "title": "Mother and child die from injuries after Munich car attack",
        "summary": "The 37-year-old woman and two-year -old child are the first fatalities from last week's attack. The woman and child were killed in the attack on a London street last week.",
        "link": "https://www.bbc.com/news/articles/czrl51mz7k8o",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 18:29:13 GMT"
    },
    {
        "title": "Why don't Europeans buy more American cars?",
        "summary": "Trump wants US vehicles to be more popular in Europe, but it's a difficult market for them to crack. The U.S. is the world's largest car market, but Europe is the second largest.",
        "link": "https://www.bbc.com/news/articles/cq8kn5v37wxo",
        "source": "BBC News",
        "publication_date": "Fri, 14 Feb 2025 22:54:48 GMT"
    },
    {
        "title": "Israeli hostages and Palestinian inmates freed in latest ceasefire swap",
        "summary": "Hamas releases three more Israelis, as 369 Palestinians are handed over in the sixth exchange in recent weeks. Hamas releases 3 more Israelis and hands over 369 Palestinians.",
        "link": "https://www.bbc.com/news/articles/c4g7n3l98z6o",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 17:11:31 GMT"
    },
    {
        "title": "Laura Whitmore shares final messages from Caroline Flack",
        "summary": "The TV presenter posted screenshots of the exchanges on the fifth anniversary of Flack's death. The exchanges took place on the day of the singer's death in 2007.",
        "link": "https://www.bbc.com/news/articles/c0e4vp13qwdo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 14:03:45 GMT"
    },
    {
        "title": "'We followed lives of children surviving war in Gaza. Here's what we found'",
        "summary": "BBC film shows children in Gaza and how they are coping with the conflict. Among them is an 11-year-old boy who volunteers at a hospital and dreams of becoming a paramedic.",
        "link": "https://www.bbc.com/news/articles/c5y7ndlrl3vo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 00:49:09 GMT"
    },
    {
        "title": "'Extraordinarily poorly judged' - analysing JD Vance's attacks on Europe",
        "summary": "US Vice President JD Vance shocked at delegates at the Munich Security Conference. Security correspondent Frank Gardner called it a 'very weird 20 minutes' US Vice President Vance was speaking to delegates at a security conference in Munich.",
        "link": "https://www.bbc.com/news/articles/c4g9nmeyzkjo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 14:16:46 GMT"
    },
    {
        "title": "Comedians on whether Peter Kay was right to throw out hecklers",
        "summary": "UK comics talk about the \"chaos\" and \"magic\" of heckling. The star kicked two fans out after they heckled him.",
        "link": "https://www.bbc.com/news/articles/cy48x8yz4d3o",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 09:38:04 GMT"
    },
    {
        "title": "Frightened looks and military vehicles in French hamlet where British couple died",
        "summary": "Locals who knew Andrew and Dawn Searle describe their shock. This is a difficult moment for a rural community in the glare of a criminal investigation.",
        "link": "https://www.bbc.com/news/articles/cj91kgv8v1lo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 07:33:51 GMT"
    },
    {
        "title": "Michelin star hotspot in tiny Lancashire village 'not many people know about'",
        "summary": "West Lancashire village has three Michelin star restaurants within a mile radius. There are also two Michelin-starred pubs in the village.",
        "link": "https://www.bbc.com/news/articles/cly9epejepgo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 13:29:24 GMT"
    },
    {
        "title": "UK and EU countries must spend more on defence, says Lammy",
        "summary": "Vladimir Putin would not \"go away\" even in the event of a negotiated peace in Ukraine, says Boris Johnson. The foreign secretary said the Russian president would not go away even if a peace deal was reached.",
        "link": "https://www.bbc.com/news/articles/cgq0x30kkldo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 18:24:35 GMT"
    },
    {
        "title": "'Sad day for tennis' - Sinner doping ban 'leaves sour taste'",
        "summary": "Jannik Sinner's doping case has divided the tennis world for months. The news he will serve a three-month ban leads to further questions and criticism.",
        "link": "https://www.bbc.com/sport/tennis/articles/cz7e4l2248wo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 18:48:18 GMT"
    },
    {
        "title": "Gunfire and looting in DR Congo city as rebels advance",
        "summary": "Residents in the Congolese city tell the BBC they are hiding in their homes as the rebels advance. Residents say they have been forced to flee their homes by the rebels.",
        "link": "https://www.bbc.com/news/articles/c1m5dppk5xmo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 17:53:04 GMT"
    },
    {
        "title": "One dead after attempted Channel crossing",
        "summary": "Sixty-nine others were rescued after the boat started to take on water off the coast of Calais. Sixty-eight people were rescued from the boat after it started totake on water.",
        "link": "https://www.bbc.com/news/articles/cvgm2vwxdn0o",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 16:36:17 GMT"
    },
    {
        "title": "French customs seize dinosaur teeth found in lorry",
        "summary": "The teeth belong to creatures from roughly 70 million years ago. The teeth were discovered in a lorry. They are believed to have been found in a quarry in South Africa.",
        "link": "https://www.bbc.com/news/articles/cqx95zyzyv7o",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 18:19:27 GMT"
    },
    {
        "title": "Netflix moves Bafta afterparty after hotel fire",
        "summary": " streaming giant will now hold its event at The Twenty Two, a luxury London hotel. The event will take place on Sunday night at 9pm.",
        "link": "https://www.bbc.com/news/articles/c5yd1377n3eo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 15:46:43 GMT"
    },
    {
        "title": "'Trapped in our home' - Doorbell camera captures neighbour's abuse and threats",
        "summary": "Data shows 36% of people experienced anti-social behaviour last year. That's up from 34% the year before, according to new figures.",
        "link": "https://www.bbc.com/news/articles/cy8p3dd5ez3o",
        "source": "BBC News",
        "publication_date": "Fri, 14 Feb 2025 18:07:28 GMT"
    },
    {
        "title": "World's sea-ice falls to record low",
        "summary": "The world's frozen oceans keep the planet cool, but they currently have less ice than ever recorded before. There is less ice in the world's oceans than there has ever been before.",
        "link": "https://www.bbc.com/news/articles/cvgeydkz08go",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 00:45:06 GMT"
    },
    {
        "title": "What it means when Elon Musk brings his children to work",
        "summary": "Billionaire Elon Musk has two children. One of his children is often seen on his shoulders when he makes public appearances. Elon Musk is the founder and CEO of electric car company Tesla.",
        "link": "https://www.bbc.com/news/articles/cvgerr2jvkgo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 02:14:16 GMT"
    },
    {
        "title": "UK ticket-holder wins £65m Valentine's Day EuroMillions jackpot",
        "summary": "The successful player matched all seven Valentine's Day numbers, the lottery operator said. The winning numbers are 1, 2, 3, 4, 5, 6, 7 and 8.",
        "link": "https://www.bbc.com/news/articles/czxk9yepnd9o",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 12:29:38 GMT"
    },
    {
        "title": "How I exposed MI5's lie about its violent abusive agent",
        "summary": "The Security Service gambled BBC correspondent Daniel De Simone had no evidence. A note, an email and a recording proved it wrong. The security service was wrong.",
        "link": "https://www.bbc.com/news/articles/cx25m231n8xo",
        "source": "BBC News",
        "publication_date": "Wed, 12 Feb 2025 14:47:03 GMT"
    },
    {
        "title": "'We left pieces of our life behind': Indigenous group flees drowning island",
        "summary": "Rising sea levels threaten homes in Panama, but not everyone wants to leave. Some people in Panama want to stay, while others want to move.",
        "link": "https://www.bbc.com/news/articles/cz0lg9pedz1o",
        "source": "BBC News",
        "publication_date": "Sat, 08 Feb 2025 01:47:48 GMT"
    },
    {
        "title": "How Somalis see the 'Black Hawk Down' battle three decades on",
        "summary": "The BBC speaks to some still affected by the disaster. A documentary about the military disaster is released this week. The BBC talks to some of the people still affected.",
        "link": "https://www.bbc.com/news/articles/c4gx0jw5v1lo",
        "source": "BBC News",
        "publication_date": "Sun, 09 Feb 2025 12:41:41 GMT"
    },
    {
        "title": "'He can smell danger' - is Merino Arsenal's striker solution?",
        "summary": "Mikel Merino makes his case to be Arsenal's striker solution after his match-winning heroics in the vital win at Leicester City. BBC Sport Chief Football Writer Phil McNulty says Merino is the man for the job.",
        "link": "https://www.bbc.com/sport/football/articles/c0m1d4z9vdro",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 16:35:59 GMT"
    },
    {
        "title": "'Sad day for tennis' - Sinner doping ban 'leaves sour taste'",
        "summary": "Jannik Sinner's doping case has divided the tennis world for months. The news he will serve a three-month ban leads to further questions and criticism.",
        "link": "https://www.bbc.com/sport/tennis/articles/cz7e4l2248wo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 18:48:18 GMT"
    },
    {
        "title": "Gourley & Nielsen break British records at Keely Klassic",
        "summary": "Neil Gourley breaks the men's British indoor 1,000m. Lina Nielsen does the same in the women's 300m at the Keely Klassic.",
        "link": "https://www.bbc.com/sport/athletics/articles/cq6gezz4v4lo",
        "source": "BBC News",
        "publication_date": "Sat, 15 Feb 2025 18:45:05 GMT"
    },
    {
        "title": "BBC News app",
        "summary": "CNN.com will be bringing you live updates from CNN iReport. Follow us on Twitter and Facebook for the latest news. Use the weekly Newsquiz to test your knowledge of stories you saw on CNN.",
        "link": "https://www.bbc.co.uk/news/10628994",
        "source": "BBC News",
        "publication_date": "Tue, 20 Aug 2024 11:35:33 GMT"
    },
    {
        "title": "The Week: What next for Ukraine and some signs of growth?",
        "summary": "Adam, Chris, Caitríona and James wrap up the week with a look back at the last few days. Adam, Chris and James: What did you do this week? Tell us in the comments.",
        "link": "https://www.bbc.co.uk/sounds/play/p0kr7tmr",
        "source": "BBC News",
        "publication_date": "Fri, 14 Feb 2025 10:18:00 GMT"
    },
    {
        "title": "What’s up with Gen Z?",
        "summary": "Less than half of Generation Z are proud to be British, according to a new study. The study was carried out by the British Centre for Social Research in London.",
        "link": "https://www.bbc.co.uk/sounds/play/m0027ty6",
        "source": "BBC News",
        "publication_date": "Thu, 13 Feb 2025 05:00:00 GMT"
    },
    {
        "title": "Israel and Hamas Finish 6th Exchange of Hostages for Prisoners",
        "summary": "Hamas freed three Israelis who appeared to be in relatively good condition. Israel released 369 Palestinian prisoners. The exchange will likely sustain a fragile cease-fire, at least for now.",
        "link": "https://www.nytimes.com/live/2025/02/15/world/israel-hamas-gaza-hostages",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 18:09:16 +0000"
    },
    {
        "title": "A Quick, Quiet Trip to Belarus Signals a Turn in U.S. Policy",
        "summary": "The U.S. has been trying to isolate Russia’s closest ally, Belarus. A meeting with Belarus's president points to better relations, raising hopes.",
        "link": "https://www.nytimes.com/2025/02/15/world/europe/belarus-us-prisoners-diplomacy.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 10:34:07 +0000"
    },
    {
        "title": "German Chancellor Rebukes Vance for Supporting Party That Downplays Nazis",
        "summary": "Olaf Scholz accused the U.S. vice president of unacceptable interference in Germany’s coming elections. At the Munich Security Conference, OlafScholz said that the vice president should not have been allowed to attend.",
        "link": "https://www.nytimes.com/2025/02/15/world/europe/scholz-vance-munich-germany.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 18:08:56 +0000"
    },
    {
        "title": "Even in Death, Navalny Is Seen by the Kremlin as an Enduring Threat",
        "summary": "Russian authorities have zealously prosecuted people with links to Aleksei A. Navalny’s organization inside Russia in the year since he died.",
        "link": "https://www.nytimes.com/2025/02/15/world/europe/navalny-russia-death.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 12:39:39 +0000"
    },
    {
        "title": "Armed Bandits in Brazil Pursue New Loot: Ozempic",
        "summary": "Criminals are targeting pharmacies and stealing weight-loss medication. Many cannot afford the drugs in a country with body image insecurities.",
        "link": "https://www.nytimes.com/2025/02/15/world/americas/brazil-robbery-pharmacy-ozempic.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 10:01:02 +0000"
    },
    {
        "title": "Have You Seen This Pilgrim? Lost in the Throngs of the Kumbh Mela.",
        "summary": "The lost-and-found center at the world's largest religious gathering attends to the faithful’s earthly needs as they perform rituals intended to purify the soul.",
        "link": "https://www.nytimes.com/2025/02/15/world/asia/india-kumbh-mela.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 10:00:41 +0000"
    },
    {
        "title": "Cuts to U.S.-Backed Rights Groups Seen as a Win for China",
        "summary": "U.S. funding for the promotion of democracy has been frozen, disrupting the work of groups that expose abuses in China. Chinese nationalists are celebrating.",
        "link": "https://www.nytimes.com/2025/02/14/world/asia/us-rights-groups-doge-cuts-china.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 23:39:09 +0000"
    },
    {
        "title": "Vance Tells Europeans to Stop Shunning Parties Deemed Extreme",
        "summary": "His comments seemed to target efforts to sideline the hard-right party the Alternative for Germany. His comments shocked attendees at the Munich Security Conference.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/vance-europe-immigration-ukraine.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 02:56:12 +0000"
    },
    {
        "title": "Zelensky Says Ukraine Is Unlikely to Survive the War Without U.S. Support",
        "summary": "His comments came on the first day of the Munich Security Conference. European officials had hoped to learn more about U.S. plans to broker peace talks.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/zelensky-nbc-meet-the-press.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 02:21:00 +0000"
    },
    {
        "title": "High Above Chernobyl, Workers Grapple With Ice, Fire and Nuclear Fears",
        "summary": "An apparent drone strike blew a hole in the protective shell. There is an urgent need to patch what covers the wreckage of the world’s worst nuclear accident.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/chernobyl-drone-blast-scene.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 18:35:46 +0000"
    },
    {
        "title": "For Ukraine War Widows, Valentine’s Day is a Painful Reminder",
        "summary": "Cellphone messages provide a cherished link for Ukrainians whose partners are away fighting. When the answers dry up, the last words can become poignant symbols of loss.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/ukrainian-war-widows-valentines-day.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 05:01:22 +0000"
    },
    {
        "title": "With Fighting Stilled, Gazans Face New Trauma: Searching for Their Dead",
        "summary": "Thousands of bodies may be unearthed from Gaza’s ruins, authorities say. Families with missing loved ones face fresh horrors as they search the rubble.",
        "link": "https://www.nytimes.com/2025/02/14/world/middleeast/gaza-rubble-missing-bodies.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 14:32:43 +0000"
    },
    {
        "title": "Whiskey Offers Window Into the Pain of a Trade War",
        "summary": "European tariffs on American whiskey snap back after March 31 unless an extension is granted. Liquor is leverage as the world careens toward another trade dispute.",
        "link": "https://www.nytimes.com/2025/02/14/business/economy/whiskey-tariffs.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 10:00:54 +0000"
    },
    {
        "title": "Tensions Build in Syria Between New Leaders and Kurdish-Led Militia",
        "summary": "The interim government in Damascus has called for a powerful Kurdish-led militia backed by the United States to disarm and integrate into a national military force.",
        "link": "https://www.nytimes.com/2025/02/14/world/middleeast/syria-kurdish-militia.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 17:10:25 +0000"
    },
    {
        "title": "Relief in Israel as Newly Released Hostages Appear to Be in Better Shape",
        "summary": "A crowd gathered in Tel Aviv on Saturday to watch video of the latest handover in Gaza. The emaciated condition of the three men released last week horrified Israelis.",
        "link": "https://www.nytimes.com/2025/02/15/world/middleeast/israel-hostages-square-reaction.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 14:52:50 +0000"
    },
    {
        "title": "Love Letters",
        "summary": "Mail and phone calls may be archaic, but they have lessons for us on how to be better communicators. We can learn from their mistakes and improve our communication skills.",
        "link": "https://www.nytimes.com/2025/02/15/briefing/love-letters.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 11:05:42 +0000"
    },
    {
        "title": "In D.C. Visit, Canadian Leaders Face Trump’s Tariff Hawks",
        "summary": "Canada's premiers visited Washington this week to make the case for open trade. But influential figures in the president’s circle see tariffs as the path to prosperity.",
        "link": "https://www.nytimes.com/2025/02/15/world/canada/canada-premiers-trump-tariffs.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 11:00:06 +0000"
    },
    {
        "title": "A Closer Look at the 3 Hostages Freed by Hamas",
        "summary": "The release of the men, who include an American, was the sixth in a hostage-for-prisoner exchange laid out in a cease-fire deal between Hamas and Israel.",
        "link": "https://www.nytimes.com/2025/02/15/world/middleeast/israel-hostages-freed-hamas.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 10:44:56 +0000"
    },
    {
        "title": "Tilted Axis Press Took a Big Risk on Translated Literature. It Paid Off.",
        "summary": "British publisher Tilted Axis specialized in innovative translated literature. It won them major awards. Now they're coming to the U.S. for the first time.",
        "link": "https://www.nytimes.com/2025/02/15/books/tilted-axis-books-translation.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 10:02:14 +0000"
    },
    {
        "title": "Vance Shocks Europe With Support for Far Right, in Message Familiar to U.S.",
        "summary": "The vice president's speech was a global extension of his core political themes. He expressed support for far-right, anti-immigration parties and criticized suppression of conservative voices.",
        "link": "https://www.nytimes.com/2025/02/14/us/politics/vance-far-right-germany-munich-afd.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 00:49:45 +0000"
    },
    {
        "title": "Diplomats in Munich Fear Trump Is Giving Up Leverage to Putin Before Talks With Ukraine",
        "summary": "Diplomats at the Munich Security Conference were uttering “appeasement,” with all its historical resonance, to describe the Trump administration’s approach to negotiations.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/ukraine-russia-trump-munich.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 03:35:25 +0000"
    },
    {
        "title": "Barbie Hsu, Taiwanese Actress and Star of ‘Meteor Garden,’ Dies at 48",
        "summary": "Her role in the teen drama catapulted her to fame as a pop idol. She was also a TV host and appeared in films. She is survived by her husband and two children.",
        "link": "https://www.nytimes.com/2025/02/14/world/asia/barbie-hsu-dead.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 17:45:32 +0000"
    },
    {
        "title": "Texas County Declares an Emergency Over Toxic Fertilizer",
        "summary": "Johnson County is seeking federal assistance. It says its farmland has become dangerously contaminated with “forever chemicals” from the use of fertilizer made from sewage sludge.",
        "link": "https://www.nytimes.com/2025/02/14/climate/forever-chemicals-sewage-sludge-fertilizer-texas.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 17:25:10 +0000"
    },
    {
        "title": "Tensions Mount in Lebanon as Deadline Nears for Israeli Withdrawal",
        "summary": "The U.S. has reportedly told Lebanese officials that Israel’s military intends to remain in five strategic points inside Lebanon. Israel will withdraw from towns it still occupies.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/lebanon-israeli-withdrawal.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 22:03:06 +0000"
    },
    {
        "title": "Man Is Briefly ‘Swallowed’ by Whale in Chile",
        "summary": "Adrián Simancas was caught in a humpback's lunge. “I realized that I was in something’s mouth and I had been eaten,” he said.",
        "link": "https://www.nytimes.com/2025/02/14/world/americas/whale-swallowed-man-chile.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 20:51:47 +0000"
    },
    {
        "title": "Munich Car Attack Injured Dozens: What We Know",
        "summary": "Two people were killed and nearly 40 others were injured when an Afghan asylum seeker drove a car into a union march. The police said the driver confessed.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/munich-car-attack-who-what.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 18:25:00 +0000"
    },
    {
        "title": "Sexual Violence Against Children Soars in Congo, U.N. Group Says",
        "summary": "UNICEF accused \"armed men\" of raping scores of children in the Democratic Republic of Congo. Congo has been ravaged by conflict recently.",
        "link": "https://www.nytimes.com/2025/02/14/world/africa/sexual-violence-children-congo.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 18:58:41 +0000"
    },
    {
        "title": "Trump’s Funding Freeze Raises a New Question: Is the Government’s Word Good?",
        "summary": "Companies that get federal grants or loans usually sign a legally binding agreement and depend on getting reimbursed. The new administration has upended that expectation.",
        "link": "https://www.nytimes.com/2025/02/14/climate/trumps-funding-freeze-raises-a-new-question-is-the-governments-word-good.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 14:48:01 +0000"
    },
    {
        "title": "Why Trump’s Plan to Relocate Gazans Is Untenable for Jordan",
        "summary": "President Trump’s plan would send a huge number of refugees to Jordan. It would add new frictions to the kingdom's often tense history with displaced Palestinians.",
        "link": "https://www.nytimes.com/2025/02/14/world/middleeast/trump-gaza-takeover-jordan.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 14:17:49 +0000"
    },
    {
        "title": "Britain’s Hard-Right Reform U.K. Party Wins Over Some Labour Voters",
        "summary": "Nigel Farage’s anti-immigration party is winning over some disillusioned Labour voters. They are targeting regions that are struggling economically and by campaigning on local issues.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/reform-uk-wales-farage.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 13:51:57 +0000"
    },
    {
        "title": "Pope Francis Is Admitted to Hospital for Bronchitis",
        "summary": "The 88-year-old pontiff, who has been battling health problems for years, is being treated in a Rome hospital. The pontiff has been suffering from a variety of ailments for years.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/pope-francis-hospital-bronchitis.html",
        "source": "NYT > World News",
        "publication_date": "Sat, 15 Feb 2025 18:10:21 +0000"
    },
    {
        "title": "Hamas Names Hostages Set for Release on Saturday",
        "summary": "Israel is set to free more than 360 Palestinian prisoners. The exchange had been thrown into doubt after days of mutual recriminations. But it now appears to be on track.",
        "link": "https://www.nytimes.com/2025/02/14/world/middleeast/israel-hamas-gaza-hostages.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 19:48:39 +0000"
    },
    {
        "title": "Remnants of a Roman Basilica Are Found Under a London Office Building",
        "summary": "The 2,000-year-old basilica was “once the beating heart of Roman London,” the Museum of London Archaeology said.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/london-roman-basilica.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 11:41:10 +0000"
    },
    {
        "title": "China Says U.S. Should Lead Trump’s Proposed Arms Controls Push",
        "summary": "President Trump said China and Russia should halve their military spending and limit nuclear weapons. China said. \"You first, China first,\" President Trump said.",
        "link": "https://www.nytimes.com/2025/02/14/world/asia/china-trump-nuclear-military.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 11:26:00 +0000"
    },
    {
        "title": "Russian Drone Hits Chernobyl Nuclear Radiation Shield, Ukraine Says",
        "summary": "Ukraine's president calls the damage \"significant\" but says there are no signs of radiation leaks. A Kremlin spokesman denied that Russia had carried out the strike.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/chernobyl-drone-ukraine-russia-nuclear.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 17:24:03 +0000"
    },
    {
        "title": "Ukrainians Fear Peace May Strand Them Forever From Lost Homes",
        "summary": "\"It's like ripping off a man’s arm or leg and then saying, ‘Let it be as it is’”",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/occupied-ukraine-russia-peace.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 11:23:57 +0000"
    },
    {
        "title": "These Podcasters Want to Teach You How to Date",
        "summary": "Elizabeth Day, a British writer, and Mel Schilling, a dating coach, are the hosts of the new podcast “How to Date.” In time for Valentine’s Day, here are their top tips.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/how-to-date-podcast.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 10:30:07 +0000"
    },
    {
        "title": "Trump Pushes Tariff Threats on Global Scale",
        "summary": "With less than a month in office, the president has pursued trade actions that could shatter the global trading system. The actions could dwarf the trade measures he took over his entire first term.",
        "link": "https://www.nytimes.com/2025/02/14/us/politics/trump-tariffs-global-trade.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 13:24:04 +0000"
    },
    {
        "title": "What’s Best, According to the Italian Mathematician Alessio Figalli",
        "summary": "Alessio Figalli studies optimal transport, a field of math that ranges from the movements of clouds to the workings of chatbots.",
        "link": "https://www.nytimes.com/2025/02/14/science/mathematics-figalli-optimal-transport.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 10:00:17 +0000"
    },
    {
        "title": "Fire at Busan Resort Construction Site Kills 6",
        "summary": "The fire at an unfinished hotel in the southeastern port city of Busan spread quickly. 25 others were injured in the blaze at the unfinished hotel.",
        "link": "https://www.nytimes.com/2025/02/14/world/asia/south-korea-busan-fire.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 14:13:45 +0000"
    },
    {
        "title": "Vance Mentions Sanctions, Military Action to Push Russia to End Ukraine War",
        "summary": "Vice President JD Vance says it's too early to talk about specific territorial or security arrangements. Vance: \"It's not the time to discuss the future of the United States\"",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/vance-russia-ukraine-war.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 05:32:44 +0000"
    },
    {
        "title": "Tropical Cyclone Zelia Makes Landfall in Northwest Australia",
        "summary": "Residents were told to stay indoors to shelter from destructive winds and flooding. The storm’s winds equaled those of a Category 4 hurricane.",
        "link": "https://www.nytimes.com/2025/02/14/world/australia/tropical-cyclone-zelia.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 05:04:49 +0000"
    },
    {
        "title": "Friday Briefing",
        "summary": "President Trump has announced new tariffs on steel and aluminum. The move could lead to a hike in U.S. tariffs on aluminum and Chinese goods.",
        "link": "https://www.nytimes.com/2025/02/14/briefing/tariffs-trump-ukraine-modi.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 05:03:32 +0000"
    },
    {
        "title": "All 3 Fayed Brothers, Ex-Owners of Harrods, Are Now Accused of Sexual Assault",
        "summary": "Mohamed al-Fayed once owned Harrods, the iconic London department store. The abuse scandal has since widened to include his sons Salah and Ali.",
        "link": "https://www.nytimes.com/2025/02/14/world/europe/harrods-mohamed-fayed-brothers-sexual-assault.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 12:32:13 +0000"
    },
    {
        "title": "Trump and Modi Shove Disputes Into Background in White House Visit",
        "summary": "India’s prime minister sought to placate President Trump in public even as Mr. Trump pushed for major tariffs on his country.",
        "link": "https://www.nytimes.com/2025/02/13/us/politics/trump-modi-musk.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 02:35:30 +0000"
    },
    {
        "title": "Judge Extends Halt on Trump Plan to Dismantle U.S.A.I.D.",
        "summary": "A judge will keep a hold on a directive placing more than 2,000 employees on administrative leave and forcing the return of overseas workers for at least another week.",
        "link": "https://www.nytimes.com/2025/02/13/us/politics/judge-trump-usaid.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 00:24:21 +0000"
    },
    {
        "title": "As Ukraine Presses for Role in Russia Peace Talks, Trump Offers Reassurances",
        "summary": "Ukraine and European defense ministers expressed concern that they might not be present for talks between President Trump and Russia’s leader to end the war. President Volodymyr Zelensky of Ukraine and European Defense ministers had expressed concern.",
        "link": "https://www.nytimes.com/2025/02/13/world/europe/ukraine-russia-peace-talks-europe.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 00:10:30 +0000"
    },
    {
        "title": "U.S.S. Harry S. Truman Carrier Collides With Commercial Ship Off Egypt",
        "summary": "The U.S. Harry S. Truman had launched airstrikes against the Houthis in Yemen. It struck a commercial vessel near Port Said on Wednesday, Navy officials said.",
        "link": "https://www.nytimes.com/2025/02/13/world/middleeast/us-navy-carrier-commercial-ship-collision.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 00:40:50 +0000"
    },
    {
        "title": "No Tubman, No Rainbows: Defense Schools Prepared for Hegseth’s Wife",
        "summary": "The American schools at the NATO headquarters were scrambling to comply with Trump diversity, equity and inclusion rollbacks. An expected visit from Pete Hegseth’s wife intensified that effort.",
        "link": "https://www.nytimes.com/2025/02/13/world/europe/nato-school-dei-hegseth.html",
        "source": "NYT > World News",
        "publication_date": "Thu, 13 Feb 2025 21:53:48 +0000"
    },
    {
        "title": "Friday Briefing: Trump Orders New Global Tariffs",
        "summary": "\"Saturday Night Live\" turns 50 this year. \"SNL\" will celebrate its 50th anniversary this year with a special episode. The show will also celebrate its 30th anniversary with a new episode.",
        "link": "https://www.nytimes.com/2025/02/13/briefing/trump-tariffs-ukraine-europe-hamas-hostages.html",
        "source": "NYT > World News",
        "publication_date": "Thu, 13 Feb 2025 22:02:39 +0000"
    },
    {
        "title": "NATO Worries Grow That Europe Will Be Left Out of Talks to End War in Ukraine",
        "summary": "President Trump has made it clear that he is pushing for an end to the war in Ukraine. The move has left Europe worried that it, and Ukraine, could be left out as he negotiates with Russia's leader.",
        "link": "https://www.nytimes.com/2025/02/13/world/europe/nato-ukraine-war-eu.html",
        "source": "NYT > World News",
        "publication_date": "Thu, 13 Feb 2025 21:44:53 +0000"
    },
    {
        "title": "Trump Funding Freeze Decimates Women’s Health Care, U.N. and Others Say",
        "summary": "Three weeks into the Trump administration's suspension of money for foreign aid, those who work in women’s health say the impact has already been devastating.",
        "link": "https://www.nytimes.com/2025/02/13/world/africa/trump-funding-freeze-womens-health.html",
        "source": "NYT > World News",
        "publication_date": "Thu, 13 Feb 2025 22:23:43 +0000"
    },
    {
        "title": "Trump’s Whirlwind Now Blows Through Europe",
        "summary": "The new Trump foreign policy team has brought a dizzying message to European allies on A.I., Ukraine and more. It has already left many angered and chagrined.",
        "link": "https://www.nytimes.com/2025/02/13/world/europe/trump-europe-tariffs-ukraine-nato.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 18:52:25 +0000"
    },
    {
        "title": "Trump Announces ‘Reciprocal’ Tariffs Across the Globe",
        "summary": "The president said his advisers would devise new tariff levels reflecting countries’ tariffs, taxes, subsidies and other policies affecting trade with the United States.",
        "link": "https://www.nytimes.com/2025/02/13/us/politics/trump-tariffs.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 00:29:27 +0000"
    },
    {
        "title": "Protests in Brussels Halt Over 400 Flights and Snarl Public Transit",
        "summary": "All flights into and out of Brussels Airport were canceled. Tens of thousands of demonstrators in Brussels protested the government’s proposed pension reforms and cuts to public services.",
        "link": "https://www.nytimes.com/2025/02/13/world/europe/brussels-protests-air-traffic.html",
        "source": "NYT > World News",
        "publication_date": "Thu, 13 Feb 2025 16:06:19 +0000"
    },
    {
        "title": "James Howells’s Final Proposal to Recover Lost Bitcoin: Buying the Landfill",
        "summary": "James Howells has begged officials to let him dig through a South Wales landfill to find a lost Bitcoin wallet. He says the wallet is worth around $800 million.",
        "link": "https://www.nytimes.com/2025/02/13/world/europe/bitcoin-wales-james-howells-landfill.html",
        "source": "NYT > World News",
        "publication_date": "Fri, 14 Feb 2025 02:33:15 +0000"
    },
    {
        "title": "U.S. Deports Migrants From Asia to Panama",
        "summary": "The move could herald a new front in the Trump administration’s plans for mass deportations. It allows for more rapid removal of migrants whose home countries are reluctant to accept them.",
        "link": "https://www.nytimes.com/2025/02/13/us/politics/trump-deportations-panama.html",
        "source": "NYT > World News",
        "publication_date": "Thu, 13 Feb 2025 18:00:49 +0000"
    }
]