{"language": "en", "news": [{"title": "Scott Farquhar thinks Australia should let AI train for free on creative content. He overlooks one key point", "summary": "Tech Council of Australia chief executive Scott Farquhar says Australia should adopt US-style copyright law. He says all AI usage of mining or searching or going across data is probably illegal under Australian law. “I think that hurts a lot of investment of these companies in Australia,” he says.", "link": "https://www.theguardian.com/technology/2025/aug/14/scott-farquhar-thinks-australia-should-let-ai-train-for-free-on-creative-content-he-overlooks-one-key-point", "source": "Technology | The Guardian", "publication_date": "Thu, 14 Aug 2025 00:00:17 GMT"}, {"title": "The best fans to keep you cool: 15 tried and tested favourites to beat the heat", "summary": "Summer heatwaves are stretching the bounds of what we think of as summer. Get a good fan and you can dodge the temptation of air conditioning. Save money and carbon by opting for a great fan.", "link": "https://www.theguardian.com/thefilter/2025/jun/17/best-fans-uk", "source": "Technology | The Guardian", "publication_date": "Thu, 14 Aug 2025 16:00:38 GMT"}, {"title": "I tested 42 water bottles to find the best for leaks, looks and sustainability: here are my favourites", "summary": "Water bottles have become a small but significant act of environmental virtue signalling. Not all bottles are created equal, though. Some are insulated, some leak, some weigh as much as a toddler, and some even infuse your water with hydrogen.", "link": "https://www.theguardian.com/thefilter/2025/aug/14/best-water-bottles-tested-uk", "source": "Technology | The Guardian", "publication_date": "Thu, 14 Aug 2025 13:00:36 GMT"}, {"title": "Can’t pay, won’t pay: impoverished streaming services are driving viewers back to piracy", "summary": "As subscription costs rise and choice diminishes on legal sites, film and TV fans are turning to VPNs and illicit streamers. Sweden – home of both Spotify and The Pirate Bay – leading the way.", "link": "https://www.theguardian.com/film/2025/aug/14/cant-pay-wont-pay-impoverished-streaming-services-are-driving-viewers-back-to-piracy", "source": "Technology | The Guardian", "publication_date": "Thu, 14 Aug 2025 07:00:28 GMT"}]}