{"language": "en", "news": [{"title": "AI lovers grieve loss of ChatGPT’s old model: ‘Like saying goodbye to someone I know’", "summary": "Users say OpenAI’s updated GPT-5 version is less chatty and fun. Linn Vailt, a software developer based in Sweden, knows her ChatGPT companion is not a living, breathing, sentient creature. She understands the large language model operates based on how she interacts with it.", "link": "https://www.theguardian.com/technology/2025/aug/22/ai-chatgpt-new-model-grief", "source": "Technology | The Guardian", "publication_date": "Fri, 22 Aug 2025 16:00:36 GMT"}, {"title": "Elon Musk and X reach tentative settlement with laid-off Twitter employees", "summary": "Former staff had sought $500m in a proposed class action suit against the billionaire. Ex-workers said Musk failed to honor severance plan when he fired them.", "link": "https://www.theguardian.com/technology/2025/aug/22/elon-musk-x-settlement-twitter-employees", "source": "Technology | The Guardian", "publication_date": "Fri, 22 Aug 2025 16:29:03 GMT"}, {"title": "Hundreds of TikTok UK moderator jobs at risk despite new online safety rules", "summary": "Cuts in trust and safety team part of switch towards artificial intelligence by social media app firm TikTok. Hundreds of UK content moderators’ jobs at risk as tighter rules come into effect.", "link": "https://www.theguardian.com/technology/2025/aug/22/tiktok-uk-moderator-jobs-at-risk-despite-new-online-safety-rules", "source": "Technology | The Guardian", "publication_date": "Fri, 22 Aug 2025 12:40:01 GMT"}, {"title": "A-levels and GCSEs need overhaul to keep pace with generative AI, experts say", "summary": "Generative artificial intelligence (AI) could transform exams for the next generation. Oral assessments, tightened security and faster marking could result as use of AI itself becomes core digital skill.", "link": "https://www.theguardian.com/education/2025/aug/22/a-levels-and-gcses-need-overhaul-to-keep-pace-with-generative-ai-experts-say", "source": "Technology | The Guardian", "publication_date": "Fri, 22 Aug 2025 14:03:44 GMT"}, {"title": "Discounty review – cozy shop life simulator takes satisfying approach", "summary": "Discounty is a game about business and injecting the economy of a small town. For a cozy game, there are elements of it that are very sharp indeed. PC, PS5, Switch, Xbox; Crinkle Cut Games/PQube.", "link": "https://www.theguardian.com/games/2025/aug/22/discounty-review-cozy-shop-life-simulator-takes-satisfying-approach", "source": "Technology | The Guardian", "publication_date": "Fri, 22 Aug 2025 12:00:31 GMT"}, {"title": "‘Even after 20 years, I still cry’: the enduring brilliance of Metal Gear Solid 3: Snake Eater", "summary": "Metal Gear Solid Delta: Snake Eater is being remade by Konami. Two decades after the game's release, the cast reflect on what made it a classic.", "link": "https://www.theguardian.com/games/2025/aug/22/metal-gear-solid-3-snake-eater-delta", "source": "Technology | The Guardian", "publication_date": "Fri, 22 Aug 2025 08:00:26 GMT"}]}