{"language": "en", "news": [{"title": "Musk’s AI firm forced to delete posts praising Hitler from Grok chatbot", "summary": "Elon Musk’s artificial intelligence firm xAI has deleted ‘inappropriate’ posts on X. Bot began praising Adolf Hitler, referring to itself as MechaHitler and making antisemitic comments.", "link": "https://www.theguardian.com/technology/2025/jul/09/grok-ai-praised-hitler-antisemitism-x-ntwnfb", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 03:17:18 GMT"}, {"title": "Futurist Adam Dorr on how robots will take our jobs: ‘We don’t have long to get ready – it’s going to be tumultuous’", "summary": "Social scientist Adam Dorr says robots and artificial intelligence will dominate the global economy within a generation. Dorr heads a team of researchers who have studied patterns of technological change over millennia. He says the current wave will not just convulse but obliterate the labour market by 2045.", "link": "https://www.theguardian.com/technology/2025/jul/09/futurist-adam-dorr-robots-ai-jobs-replace-human-labour", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 04:00:42 GMT"}, {"title": "Sony WH-1000XM6 review: raising the bar for noise-cancelling headphones", "summary": "Upgraded Bluetooth cans fold up, fit well, have long battery life, sound great and reduce more noise than rivals. Sony 1000X series has long featured some of the best noise cancelling you can buy.", "link": "https://www.theguardian.com/technology/2025/jul/09/sony-wh-1000xm6-review-raising-the-bar-for-noise-cancelling-headphones", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 06:00:43 GMT"}, {"title": "‘I was nervous to ask for your socials’: why missed connection posts are making a comeback", "summary": "The popular Craigslist tradition is seeing a revival from Reddit and TikTok users. In the comments of a post  on the subreddit r/warpedtour, attendees of the punk rock and emo music festival searched for missed connections.", "link": "https://www.theguardian.com/lifeandstyle/2025/jul/09/missed-connection-posts-reddit-tiktok-craiglist", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 11:00:49 GMT"}]}