{"language": "en", "news": [{"title": "UK has backed down on demand to access US Apple user data, spy chief says", "summary": "Tulsi Gabbard says Home Office no longer demanding ‘backdoor’ to encrypted material. US director of national intelligence posted the claim on X following a months-long dispute.", "link": "https://www.theguardian.com/technology/2025/aug/19/uk-has-backed-down-on-demand-to-access-us-apple-user-data-spy-chief-says", "source": "Technology | The Guardian", "publication_date": "Tue, 19 Aug 2025 12:19:12 GMT"}, {"title": "US surveillance firms run a victory lap amid Trump’s immigration crackdown", "summary": "TechScape is a weekly, offbeat look at what's happening in the world of tech. This week, Blake Montgomery looks at the latest in the field of artificial intelligence. Plus, Microsoft helps monitoring of Palestinian phone lines, Meta faces backlash over child safety.", "link": "https://www.theguardian.com/technology/2025/aug/18/trump-enterprise-surveillance-microsoft-meta-robots", "source": "Technology | The Guardian", "publication_date": "Tue, 19 Aug 2025 13:18:16 GMT"}, {"title": "Intel secures $2bn lifeline from Japan’s SoftBank", "summary": "SoftBank to invest $2bn (£1.5bn) in struggling US chip maker. Move expected to give it a 2% stake in the business. Comes amid reports US government is also considering taking a stake.", "link": "https://www.theguardian.com/technology/2025/aug/19/intel-japan-softbank-us-government", "source": "Technology | The Guardian", "publication_date": "Tue, 19 Aug 2025 12:38:29 GMT"}, {"title": "Drag x Drive review – wheelchair basketball that might give you wrist cramp", "summary": "Drag x Drive is the latest Nintendo Switch game to showcase the console's Joy-Con upgrades. You play competitive wheelchair basketball with the new mouse mode. A solid exhibition of a controller upgrade, to be sure, but Drag x Drive struggles to harness the high-octane nature of the real-world sport.", "link": "https://www.theguardian.com/games/2025/aug/19/drag-x-drive-review-nintendo-switch-2", "source": "Technology | The Guardian", "publication_date": "Tue, 19 Aug 2025 11:00:10 GMT"}]}