{"language": "en", "news": [{"title": "The CEO who never was: how Linda Yaccarino was set up to fail at Elon Musk’s X", "summary": "Linda Yaccarino, an NBC advertising executive, joined what was then still known as Twitter in May 2023. She was given a tall order: repair the company’s relationship with advertisers after a chaotic year of being owned by Elon Musk. Just weeks after she became CEO, Musk posted an antisemitic tweet that drove away major brands like Disney, Paramount, NBCUniversal, Comcast, Lionsgate and Warner Bros Discovery.", "link": "https://www.theguardian.com/technology/2025/jul/10/linda-yaccarino-resigns-x-elon-musk", "source": "Technology | The Guardian", "publication_date": "Thu, 10 Jul 2025 09:00:15 GMT"}, {"title": "AI-generated child sexual abuse videos surging online, watchdog says", "summary": "Internet Watch Foundation verified 1,286 AI-made videos in first half of year. mostly in worst category of abuse.", "link": "https://www.theguardian.com/technology/2025/jul/10/ai-generated-child-sexual-abuse-videos-surging-online-iwf", "source": "Technology | The Guardian", "publication_date": "Thu, 10 Jul 2025 05:00:12 GMT"}, {"title": "Children limiting own smartphone use to manage mental health, survey finds", "summary": "Teenagers increasingly taking breaks as they control own use of devices, experts say. They are reacting to growing concerns that spending too much time online can be harmful.", "link": "https://www.theguardian.com/technology/2025/jul/10/children-limiting-own-smartphone-use-manage-mental-health-survey", "source": "Technology | The Guardian", "publication_date": "Thu, 10 Jul 2025 04:00:10 GMT"}, {"title": "Cosy video games are on an unstoppable rise. Will they unleash a darker side?", "summary": "Non-violent games about cooking, farming or tidying now rival the more traditional video game pursuits of shooting and fighting. So what will the #cozy genre tackle next? In 2017, a game design thinktank called Project Horseshoe gathered a group of developers together to define the concept of cosiness in video games.", "link": "https://www.theguardian.com/games/2025/jul/10/cosy-video-games-non-violent-cooking-farming-cozy", "source": "Technology | The Guardian", "publication_date": "Thu, 10 Jul 2025 10:02:16 GMT"}]}