{"language": "en", "news": [{"title": "Elon Musk buys nearly $1bn in Tesla stock in push for more control", "summary": "Tesla shares rose by more than 8% after news of CEO’s transactions, a week after he was offered $1tn pay package. Elon Musk has purchased nearly $1bn worth of the electric-vehicle maker's stock, a regulatory filing showed.", "link": "https://www.theguardian.com/us-news/2025/sep/15/elon-musk-tesla-stock", "source": "Technology | The Guardian", "publication_date": "Mon, 15 Sep 2025 14:15:18 GMT"}, {"title": "iOS 26 release: everything you need to know about Apple’s Liquid Glass updates", "summary": "iOS 26, iPadOS 26, watchOS 26 and macOS 26 Tahoe introduce new Liquid Glass design. New icons, the lock screen and the system looks, as well as adding features for compatible devices.", "link": "https://www.theguardian.com/technology/2025/sep/15/ios-26-iphone-apple-release-everything-you-need-to-know-liquid-glass-updates", "source": "Technology | The Guardian", "publication_date": "Mon, 15 Sep 2025 12:33:56 GMT"}, {"title": "Google’s huge new Essex datacentre to emit 570,000 tonnes of CO2 a year", "summary": "Planning documents show impact of Thurrock ‘hyperscale’ unit as UK attempts to ramp up AI capacity. Spread across 52 hectares (128 acres), the Thurrock datacentre will be part of a wave of mammoth computer and AI power houses if it secures planning consent.", "link": "https://www.theguardian.com/technology/2025/sep/15/google-datacentre-kent-co2-thurrock-uk-ai", "source": "Technology | The Guardian", "publication_date": "Mon, 15 Sep 2025 11:48:23 GMT"}, {"title": "Google Pixel 10 Pro review: one of the very best smaller phones", "summary": "The Pixel 10 Pro is Google’s best phone that is still a pocketable, easy-to-handle size, taking the excellent Pixel 10 and beefing it up in the camera department. It is also the cheapest of three Pixel 10pro phones starting at £999 (€1,099/$999/A$1,699)", "link": "https://www.theguardian.com/technology/2025/sep/15/google-pixel-10-pro-review-one-very-best-smaller-phones", "source": "Technology | The Guardian", "publication_date": "Mon, 15 Sep 2025 06:00:55 GMT"}, {"title": "Who buys an MP3 player in 2025? Why music streaming doesn’t always cut it", "summary": "When I was 18, I bought a heavily reduced MiniDisc player. This was five years before the birth of Spotify. I’m reminded of this because this week I published a piece on the Filter about the portable audio technology that killed them: MP3 players.", "link": "https://www.theguardian.com/thefilter/2025/sep/12/who-buys-mp3-player-2025", "source": "Technology | The Guardian", "publication_date": "Mon, 15 Sep 2025 14:00:04 GMT"}, {"title": "Tinseltown takeover: how Harry Potter fanfic has become Hollywood’s hottest property", "summary": "Legendary Pictures has paid at least $3m – (£2.2m) – for the screen rights to a forthcoming novel called Alchemised that began life as an unauthorised and kinky Harry Potter spin-off. SenLinYu’s original book, titled Manacled, inhabited a strange sub-niche of Potterverse named ‘Dramione’ in which Hermione Granger finds herself regularly involved in unlikely and transgressive romantic encounters with Draco Malfoy.", "link": "https://www.theguardian.com/film/2025/sep/15/tinseltown-takeover-how-harry-potter-fanfic-has-become-hollywoods-hottest-property", "source": "Technology | The Guardian", "publication_date": "Mon, 15 Sep 2025 05:00:57 GMT"}]}