{"language": "en", "news": [{"title": "Cloudflare outage causes error messages across the internet", "summary": "US company that defends millions of websites against malicious attacks says it believes issue ‘is now resolved’ Unidentified problem meant internet users could not access some of its customers' websites.", "link": "https://www.theguardian.com/technology/2025/nov/18/cloudflare-outage-causes-error-messages-across-the-internet", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 15:11:51 GMT"}, {"title": "What AI doesn’t know: we could be creating a global ‘knowledge collapse’ | Deepak Varuvel Dennison", "summary": "As GenAI becomes the primary way to find information, local and traditional wisdom is being lost. And we are only beginning to realise what we’re missing.", "link": "https://www.theguardian.com/news/2025/nov/18/what-ai-doesnt-know-global-knowledge-collapse", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 05:00:25 GMT"}, {"title": "Amazon vs Perplexity: the AI agent war has arrived", "summary": "A lawsuit over automated shopping reveals a deeper struggle over who will control the next generation of AI. What happens when autonomous agents start acting on our behalf?", "link": "https://www.theguardian.com/technology/2025/nov/18/amazon-vs-perplexity-the-ai-agent-war-has-arrived", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 14:02:50 GMT"}, {"title": "Crypto market sheds more than $1tn in six weeks amid fears of tech bubble", "summary": "More than $1tn (£760bn) has been wiped off the value of the cryptocurrency market in the past six weeks. Fears of a tech bubble and fading expectations for a US rate cut next month are behind the fall. Tracking more than 18,500 coins, the value has fallen by a quarter since a high in early October.", "link": "https://www.theguardian.com/technology/2025/nov/18/crypto-market-tech-bubble-bitcoin-price-ai-boom", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 12:03:57 GMT"}, {"title": "‘Fear really drives him’: is Alex Karp of Palantir the world’s scariest CEO?", "summary": "Alex Karp said Palantir was ‘the most important software company in America and therefore in the world’ His company is potentially creating the ultimate state surveillance tool. Karp has recently been on a striking political and philosophical journey. His biographer reveals what makes him tick.", "link": "https://www.theguardian.com/technology/2025/nov/18/fear-really-drives-him-is-alex-karp-of-palantir-the-worlds-scariest-ceo", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 10:00:30 GMT"}, {"title": "UK consumers warned over AI chatbots giving inaccurate financial advice", "summary": "Which? study of ChatGPT, Copilot and others uncovers incorrect and misleading tips on investments, tax and insurance.", "link": "https://www.theguardian.com/technology/2025/nov/18/warning-ai-chatbots-inaccurate-financial-advice-tips-chatgpt-copilot-uk", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 06:00:26 GMT"}, {"title": "Roblox to block children from talking to adult strangers after string of lawsuits", "summary": "Online games platform Roblox is to start blocking children from talking to adult and much older teen strangers from next month. It faces fresh lawsuits alleging it has been exploited by predators to groom children as young as seven. Gaming platform to use facial age estimation to limit chats.", "link": "https://www.theguardian.com/games/2025/nov/18/roblox-facial-age-estimation-children-adults-chats-blocked", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 12:00:52 GMT"}, {"title": "Amazon selling a tasteless Christmas baby outfit is Claus for concern", "summary": "The offensive listing seemed more than a mistake – it was a failure of corporate responsibility, says reader. A corporation this large should have systems that prevent sexuali sed or exploitative language being associated with items for children.", "link": "https://www.theguardian.com/money/2025/nov/18/amazon-christmas-baby-outfit-offensive-listing", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 07:00:26 GMT"}, {"title": "Roblox rolls out age-verification features in Australia as gaming platform insists child social media ban should not apply", "summary": "Online gaming company says voluntary age assurance technology will limit teens and children messaging users outside their own age groups. It will access the camera of a user’s device and take a live estimation of their age based on their facial features. The company is releasing the new features in Australia first.", "link": "https://www.theguardian.com/games/2025/nov/19/roblox-rolls-out-age-verification-features-in-australia-as-gaming-platform-insists-child-social-media-ban-should-not-apply", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 14:00:49 GMT"}, {"title": "Master System at 40: the truth about Sega’s most underrated console", "summary": "The Nintendo Entertainment System dominated the markets in Japan and the US. But in Europe, where home computers ruled the era, the NES was beaten by a technologically superior rival. The Sega Master System was originally released in Japan in the autumn of 1985 as the Sega Mark III.", "link": "https://www.theguardian.com/games/2025/nov/18/sega-master-system-nintendo-entertainment-system", "source": "Technology | The Guardian", "publication_date": "Tue, 18 Nov 2025 12:00:51 GMT"}]}