{"language": "en", "news": [{"title": "UK online safety law leads to 5m extra age checks a day for pornography sites", "summary": "Five million extra online age checks a day are being carried out in the UK since the introduction of age-gating for pornography sites. Age Verification Providers Association said there had been a sharp increase in additional age checks.", "link": "https://www.theguardian.com/technology/2025/jul/30/uk-online-safety-law-leads-to-5m-extra-age-checks-a-day-and-surge-in-vpn-use", "source": "Technology | The Guardian", "publication_date": "Wed, 30 Jul 2025 16:21:48 GMT"}, {"title": "YouTube most popular first TV destination for children, Ofcom finds", "summary": "One in five young viewers go to platform first when they turn on TV. Older people also watch more of its content, according to Ofcom survey.", "link": "https://www.theguardian.com/technology/2025/jul/30/youtube-tv-destination-children-ofcom-survey", "source": "Technology | The Guardian", "publication_date": "Wed, 30 Jul 2025 05:00:52 GMT"}, {"title": "Samsung Galaxy Z Flip 7 review: great-looking and fun, but iterative Android", "summary": " Flagship flip folder fits even bigger screen in pocketable clamshell, with a larger cover display, slightly slimmer design and faster chip. Samsung’s seventh-generation Flip phone gains a bigger cover screen on the outside and a larger folding display on the inside.", "link": "https://www.theguardian.com/technology/2025/jul/30/samsung-galaxy-z-flip-7-review-great-looking-and-fun-but-iterative-android", "source": "Technology | The Guardian", "publication_date": "Wed, 30 Jul 2025 06:00:55 GMT"}, {"title": "Don’t feel guilty about letting your kids game during the summer break – celebrate it", "summary": "After a long day of exploring, swimming or hanging with grandparents, games from Fortnite to Super Mario are a good way to wind down. There is so much pressure and guilt around children and gaming, especially during long school breaks. I think we need to seriously redress our outlook as a society.", "link": "https://www.theguardian.com/games/2025/jul/30/dont-feel-guilty-about-letting-your-kids-game-during-the-summer-break-celebrate-it", "source": "Technology | The Guardian", "publication_date": "Wed, 30 Jul 2025 14:00:31 GMT"}, {"title": "Militsioner – finally a game that asks, is it illegal to use an apple to bribe a giant policeman?", "summary": "Planning is half the fun in immersive sims. In Militsioner, you have been arrested for some manner of nebulous crime and must now leave town as quickly as you can. Sadly, there’s that policeman to deal with first, a melancholic but watchful giant.", "link": "https://www.theguardian.com/games/2025/jul/30/militsioner-finally-a-game-that-asks-is-it-to-use-an-apple-to-bribe-a-giant-policeman", "source": "Technology | The Guardian", "publication_date": "Wed, 30 Jul 2025 11:00:01 GMT"}]}