{"language": "en", "news": [{"title": "AI could replace 3m low-skilled jobs in the UK by 2035, research finds", "summary": "Up to 3m low-skilled jobs could disappear in the UK by 2035, says report. The jobs most at risk are those in occupations such as trades, machine operations and administrative roles.", "link": "https://www.theguardian.com/technology/2025/nov/25/ai-could-replace-3m-low-skilled-jobs-by-2035-research-finds", "source": "Technology | The Guardian", "publication_date": "Tue, 25 Nov 2025 00:01:17 GMT"}, {"title": "Ofcom urges social media platforms to combat abuse and limit online ‘pile-ons’", "summary": "New guidance from UK regulator aims to combat misogynist abuse and ‘revenge porn’ Social media platforms are being urged to limit internet ‘pile-ons’", "link": "https://www.theguardian.com/media/2025/nov/25/ofcom-social-media-platforms-online-abuse-measures-limit-pile-ons", "source": "Technology | The Guardian", "publication_date": "Tue, 25 Nov 2025 06:00:26 GMT"}, {"title": "Macquarie Dictionary announces ‘AI slop’ as its word of the year, beating out Ozempic face", "summary": "The Macquarie Dictionary dubbed the term  the epitome of 2025 linguistics. Term was up against a shortlist including blind box, ate (and left no crumbs) and Roman Empire.", "link": "https://www.theguardian.com/technology/2025/nov/25/ai-slop-word-of-the-year-macquarie-dictionary-australia", "source": "Technology | The Guardian", "publication_date": "Tue, 25 Nov 2025 04:17:16 GMT"}, {"title": "How to avoid bad Black Friday laptop deals – and some of the best UK offers for 2025", "summary": "Black Friday deals have started, and if you’ve been on the lookout for a good price on a new laptop, then this could be your lucky day. But with so many websites being shouty about their Black Friday offers, the best buys aren’t always easy to spot. So before you splash the cash, it might pay to do some research – and look closely at the specification. Buy the right laptop today and you can look forward to many years of joyful productivity", "link": "https://www.theguardian.com/thefilter/2025/nov/20/best-black-friday-laptop-deals-uk-2025", "source": "Technology | The Guardian", "publication_date": "Tue, 25 Nov 2025 12:39:19 GMT"}]}