{"language": "en", "news": [{"title": "Computer maker HP to cut up to 6,000 jobs by 2028 as it turns to AI", "summary": "US firm says plan to speed up product development and improve customer satisfaction would save $1bn a year. Announcing a lower-than-expected profit outlook for the coming year, HP said it would cut  between 4,000 and 6,000 jobs by the end of October 2028.", "link": "https://www.theguardian.com/business/2025/nov/26/computer-maker-hp-to-cut-up-to-6000-jobs-by-2028-as-it-turns-more-to-ai", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 10:54:07 GMT"}, {"title": "Warner Music signs deal with AI song generator Suno after settling lawsuit", "summary": "Warner Music has signed a licensing deal with artificial intelligence song generator Suno. Music company representing Coldplay and Ed Sheeran had sued tech platform alleging mass copyright infringement.", "link": "https://www.theguardian.com/business/2025/nov/26/warner-music-signs-deal-with-ai-song-generator-suno-after-settling-lawsuit", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 10:27:15 GMT"}, {"title": "The best robot vacuums in the UK to keep your home clean and dust free, tested", "summary": "Robot vacuum cleaners take the drudge work out of cleaning your floors and carpets. Over the past few years, robot vacuums have become much more affordable, with basic units starting at about £150. They’re also doing more than they used to, mopping areas of hard flooring and charging in sophisticated cleaning stations that empty their dust collectors and clean their mop pads.", "link": "https://www.theguardian.com/thefilter/2024/nov/26/best-robot-vacuum-mop", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 10:00:21 GMT"}, {"title": "Kirby Air Riders review – cute pink squishball challenges Mario for Nintendo racing supremacy", "summary": "Kirby Air Riders is the unexpected sequel to a critically panned 2003 GameCube game. With no Grand Prix to compete in, in the game's titular mode you choose a track and compete to be the first of six players to cross the finish line.", "link": "https://www.theguardian.com/games/2025/nov/26/kirby-air-riders-review-nintendo", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 10:00:48 GMT"}]}