{"language": "en", "news": [{"title": "Larry Ellison dislodges Elon Musk as world’s richest person", "summary": "Oracle co-founder's shares rose by 40% in early trading, valuing his fortune at $393bn, just ahead of Musk’s $384bn US tech billionaire Larry Ellison has overtaken Elon Musk as the world's richest person. Ellison's wealth has surged after the company reported better than expected financial results.", "link": "https://www.theguardian.com/technology/2025/sep/10/larry-ellison-dislodges-elon-musk-as-worlds-richest-person", "source": "Technology | The Guardian", "publication_date": "Wed, 10 Sep 2025 16:03:20 GMT"}, {"title": "How to Save the Internet by Nick Clegg review – spinning Silicon Valley", "summary": "Nick Clegg was the UK’s deputy prime minister from 2010 to 2015. He was then the president of Meta from 2018 until January 2025. In that role he was responsible for bridging the worlds of Silicon Valley and Washington DC. How to Save the Internet is his report on how he handled that Herculean task.", "link": "https://www.theguardian.com/technology/2025/sep/10/how-to-save-the-internet-by-nick-clegg-review-spinning-silicon-valley", "source": "Technology | The Guardian", "publication_date": "Wed, 10 Sep 2025 06:01:03 GMT"}, {"title": "Skip Apple’s new iPhone – five tips to make your old phone feel new again", "summary": "A few inexpensive upgrades can totally reinvigorate your old iPhone. You can get even get the iPhone 17’s best feature completely free. With that simple software upgrade, a few settings tweaks, and some inexpensive accessories, your older iPhone can look and perform like new.", "link": "https://www.theguardian.com/technology/2025/sep/10/apple-iphone-tip-tricks", "source": "Technology | The Guardian", "publication_date": "Wed, 10 Sep 2025 16:00:07 GMT"}, {"title": "Cronos: The New Dawn review – survival horror is dead on arrival", "summary": "Bloober Team behind Silent Hill 2 remake and The Medium. You play an unnamed traveller sent to gather information about a devastating outbreak that transformed the citizens of a town called New Dawn. As you explore the stark, often beautifully devastated aftermath of the outbreak, you search for places where you can travel back through time.", "link": "https://www.theguardian.com/games/2025/sep/10/cronos-the-new-dawn-review-survival-horror-is-dead-on-arrival", "source": "Technology | The Guardian", "publication_date": "Wed, 10 Sep 2025 14:49:10 GMT"}, {"title": "Hollow Knight: Silksong has caused bedlam in the gaming world – and the hype is justified", "summary": "Hollow Knight Silksong is an eerie, atmospheric action game from a small developer in Australia. It was finally released last Thursday after many years in development. The art style and sound are minimalist and creepy in a Tim Burton kind of way.", "link": "https://www.theguardian.com/games/2025/sep/10/hollow-knight-silksong-has-caused-bedlam-in-the-gaming-world-and-the-hype-is-justified", "source": "Technology | The Guardian", "publication_date": "Wed, 10 Sep 2025 14:00:06 GMT"}]}