{"language": "en", "news": [{"title": "More than 200 environmental groups demand halt to new US datacenters", "summary": "Coalition of more than 230 environmental groups has demanded a national moratorium on new datacenters in the US. Latest salvo in growing backlash to booming artificial intelligence industry that has been blamed for escalating electricity bills.", "link": "https://www.theguardian.com/us-news/2025/dec/08/us-data-centers", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Dec 2025 12:00:40 GMT"}, {"title": "‘It has to be genuine’: older influencers drive growth on social media", "summary": "Caroline Idiens was on holiday halfway up an Italian mountain when her brother called to tell her to check her Instagram account. The personal trainer from Berkshire began posting her fitness classes online at the start of 2020.", "link": "https://www.theguardian.com/technology/2025/dec/08/it-has-to-be-genuine-older-influencers-drive-growth-social-media", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Dec 2025 12:48:59 GMT"}, {"title": "Social media use damages children’s ability to focus, say researchers", "summary": "Study monitored the development of more than 8,300 US-based children. Linked social media use to ‘increased inattention symptoms’", "link": "https://www.theguardian.com/technology/2025/dec/08/social-media-damages-childrens-ability-to-focus", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Dec 2025 15:02:44 GMT"}, {"title": "Scores of UK parliamentarians join call to regulate most powerful AI systems", "summary": "More than 100 UK parliamentarians are calling on the government to introduce binding regulations on the most powerful AI systems. Concern grows that ministers are moving too slowly to create safeguards in the face of lobbying from the technology industry.", "link": "https://www.theguardian.com/technology/2025/dec/08/scores-of-uk-parliamentarians-join-call-to-regulate-most-powerful-ai-systems", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Dec 2025 05:00:42 GMT"}, {"title": "Is AI a bubble that’s about to pop? – podcast", "summary": "There have been fears that artificial intelligence is a bubble and that it is about to burst. Seven companies make up one-third of the value of the S&P 500. All are heavily invested in AI.", "link": "https://www.theguardian.com/news/audio/2025/dec/08/is-ai-a-bubble-thats-about-to-pop-podcast", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Dec 2025 03:00:38 GMT"}, {"title": "‘Kids can’t buy them anywhere’: how Pokémon cards became a stock market for millennials", "summary": "The resale market for Pokémon cards has climbed so high that even new cards are valued at hundreds, before they’ve even been released. When a pack of cards retails at about £4, there’s a huge potential profit to be had.", "link": "https://www.theguardian.com/games/2025/dec/08/how-pokemon-cards-became-a-stock-market-for-millennials", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Dec 2025 10:00:37 GMT"}]}