{"language": "en", "news": [{"title": "Half of UK adults worry that AI will take or alter their job, poll finds", "summary": "Half of adults in the UK are concerned about the impact of artificial intelligence on their job, according to a poll. Job losses or changes to terms and conditions were the biggest worries for 51% of 2,600 adults surveyed for the Trades Union Congress.", "link": "https://www.theguardian.com/technology/2025/aug/27/half-of-uk-adults-worry-that-ai-will-take-or-alter-their-job-poll-finds", "source": "Technology | The Guardian", "publication_date": "Wed, 27 Aug 2025 05:00:27 GMT"}, {"title": "Starships are meant to fly: SpaceX’s rocket finally launches after setbacks", "summary": "Third time was the charm for SpaceX’s Starship megarocket after the launch had been scrubbed two times in as many days. Success of this 10th flight proved the spacecraft had overcome its past failures key to the Mars rocket's reusable design. Test flight comes after explosive failures raised doubts over founder Elon Musk's goals to reach Mars and moon.", "link": "https://www.theguardian.com/us-news/2025/aug/26/spacex-starship-launch", "source": "Technology | The Guardian", "publication_date": "Wed, 27 Aug 2025 01:17:42 GMT"}, {"title": "ChatGPT has its uses, but I still hate it – and I’ll tell you why | Imogen West-Knights", "summary": "At least six publications have had to take down published articles. They were probably pieces of fiction written by AI and then passed off by somebody as works of journalism under the name of Margaux Blanchard.", "link": "https://www.theguardian.com/commentisfree/2025/aug/27/chatgpt-ai-planet-jobs-hate", "source": "Technology | The Guardian", "publication_date": "Wed, 27 Aug 2025 07:00:27 GMT"}, {"title": "Saddle up for Wheel World, a leisurely, Lycra-less feelgood hit", "summary": "When is a racing game not a racing games? When there’s more joy to be had in pootling around enjoying the view. I love racing games precisely because they are unrealistic.", "link": "https://www.theguardian.com/games/2025/aug/26/saddle-up-wheel-world-is-a-leisurely-lycra-less-feelgood-hit", "source": "Technology | The Guardian", "publication_date": "Wed, 27 Aug 2025 14:01:04 GMT"}, {"title": "Keeper is the ecological ‘fever dream’ where you play as – checks notes – a lighthouse", "summary": "Double Fine’s latest is a whimsical action-adventure that takes inspiration from real-life biology as much as cult fantasy movies from the 1980s Keeper is staking a bold claim to be the oddest game ever published by Microsoft.", "link": "https://www.theguardian.com/games/2025/aug/27/keeper-ecological-fever-dream-where-you-play-as-a-lighthouse", "source": "Technology | The Guardian", "publication_date": "Wed, 27 Aug 2025 09:00:59 GMT"}]}