{"language": "en", "news": [{"title": "There’s an app for that: finding a sunny cafe in Paris, the city of light", "summary": "Jveuxdusoleil (I want sun) taps into a key part of Parisian culture: drinks on the terrasse. The app tracks the sun’s movement through the city to pinpoint exactly where you can claim a sunny spot for your coffee.", "link": "https://www.theguardian.com/technology/2025/aug/21/sunniest-cafe-paris-app-jveuxdusoleil", "source": "Technology | The Guardian", "publication_date": "Thu, 21 Aug 2025 09:00:06 GMT"}, {"title": "Australian livestreaming platform Kick broadcast a man’s death – could it face repercussions from regulators?", "summary": "Man in France died during a live stream on Kick, an online gaming platform. The death has sparked a police investigation and calls for regulators to examine what happened and how it was allowed to be beamed out live.", "link": "https://www.theguardian.com/technology/2025/aug/21/kick-livestream-platform-france-death-australia-esafety-ntwnfb", "source": "Technology | The Guardian", "publication_date": "Thu, 21 Aug 2025 06:53:47 GMT"}, {"title": "Angela Rayner hit with legal challenge over datacentre on green belt land", "summary": "Angela Rayner overruled a local council to approve a hyperscale datacentre in Buckinghamshire. Campaigners complain no environmental impact assessment was made for the 90MW facility.", "link": "https://www.theguardian.com/environment/2025/aug/21/angela-rayner-hit-with-legal-challenge-over-datacentre-on-green-belt-land", "source": "Technology | The Guardian", "publication_date": "Thu, 21 Aug 2025 05:00:03 GMT"}, {"title": "All Will Rise, the game empowering players to tackle real-world problems", "summary": "All Will Rise is a card game about activism. The game is designed to inspire players to engage with issues such as pollution and the climate crisis.", "link": "https://www.theguardian.com/games/2025/aug/21/all-will-rise-the-game-empowering-players-to-tackle-real-world-problems", "source": "Technology | The Guardian", "publication_date": "Thu, 21 Aug 2025 08:00:03 GMT"}]}