{"language": "en", "news": [{"title": "How thousands of ‘overworked, underpaid’ humans train Google’s AI to seem smart", "summary": "Rachael Sawyer, a technical writer from Texas, received a LinkedIn message from a recruiter hiring for a vague title of writing analyst. On her first day of work a week later, however, her expectations went bust. Her job was to rate and moderate the content created by artificial intelligence.", "link": "https://www.theguardian.com/technology/2025/sep/11/google-gemini-ai-training-humans", "source": "Technology | The Guardian", "publication_date": "Thu, 11 Sep 2025 12:00:06 GMT"}, {"title": "Larry Ellison: Oracle co-founder who overtook Musk as world’s richest person", "summary": "Ellison's net worth shot up to $393bn , surpassing Musk’s $384bn – although, by the time markets closed on Wednesday, Musk was back ahead. Ellison is friend of Trump, owner of Hawaii island and father of man who took over CBS.", "link": "https://www.theguardian.com/us-news/2025/sep/11/who-is-larry-ellison-richest-person-oracle", "source": "Technology | The Guardian", "publication_date": "Thu, 11 Sep 2025 10:28:54 GMT"}, {"title": "French lawmaker calls for criminal inquiry into TikTok’s effect on children", "summary": "Socialist MP Arthur Delaporte said he co-chaired a six-month French parliamentary inquiry into TikTok’s psychological effects on minors. He heard testimony from families, social media executives and influencers.", "link": "https://www.theguardian.com/world/2025/sep/11/lawmaker-calls-for-french-criminal-investigation-into-tiktok", "source": "Technology | The Guardian", "publication_date": "Thu, 11 Sep 2025 15:47:57 GMT"}, {"title": "The best iPhones in 2025: which Apple smartphone is right for you, according to our expert", "summary": "The best iPhone may be the one you already own. There is generally no need to buy a fresh phone just because new models have been released. There’s more to choose from in the Apple ecosystem than you may expect.", "link": "https://www.theguardian.com/technology/article/2025/feb/13/best-apple-iphone", "source": "Technology | The Guardian", "publication_date": "Thu, 11 Sep 2025 12:45:32 GMT"}, {"title": "EA Sports FC 26 preview – new play styles aim to tackle Fifa challenge", "summary": "EA has set up a new Player Feedback Portal, as well as a dedicated Discord channel. The developer has also introduced AI-powered social listening tools to monitor EA Sports FC chatter across various platforms including X, Instagram and YouTube.", "link": "https://www.theguardian.com/games/2025/sep/11/ea-sports-fc-26-preview-new-play-styles-aim-to-tackle-fifa-challenge", "source": "Technology | The Guardian", "publication_date": "Thu, 11 Sep 2025 09:00:30 GMT"}]}