{"language": "en", "news": [{"title": "How Elon Musk’s billionaire Doge lieutenant took over the US’s biggest MDMA company", "summary": "Antonio Gracias is part of the growing movement among Silicon Valley’s right wing enamored with the therapeutic and commercial potential of drugs like MDMA. Gracias attended Nova Heaven, a sunrise rave tribute to victims of the Hamas-led 7 October terrorist attack, and found himself dancing next to Rick Doblin.", "link": "https://www.theguardian.com/technology/ng-interactive/2025/aug/28/elon-musk-antonio-gracias-mdma-psychedelics-company", "source": "Technology | The Guardian", "publication_date": "Thu, 28 Aug 2025 12:00:51 GMT"}, {"title": "Tesla sales in Europe slump 40% as BYD new car registrations more than triple", "summary": "There were 8,837 sales of Tesla cars last month across the EU, the European Free Trade Association and the UK. That compared with 14,769 at the same point last year. Elon Musk's electric car company faces increasingly tough competition from its Chinese rival BYD.", "link": "https://www.theguardian.com/technology/2025/aug/28/tesla-sales-in-europe-slump-byd-new-car-registrations-more-than-triple-elon-musk", "source": "Technology | The Guardian", "publication_date": "Thu, 28 Aug 2025 10:57:09 GMT"}, {"title": "Honor Magic V5 review: fantastic foldable phone that needs better Android software", "summary": "Super-svelte body, fast chip, high capacity battery and big camera. Honor’s latest foldable phone-tablet attempts to usurp Samsung as the leader of the pack with a super-thin body, massive battery and a ginormous camera lump on the back. Main screen:  7.95in (403ppi) 120Hz OLED flexible display Cover screen: 6.43in (405ppi), 16GB, 512GB.", "link": "https://www.theguardian.com/technology/2025/aug/28/honor-magic-v5-review-fantastic-foldable-phone-better-android-software", "source": "Technology | The Guardian", "publication_date": "Thu, 28 Aug 2025 14:30:48 GMT"}, {"title": "‘AI psychosis’: could chatbots fuel delusional thinking? – podcast", "summary": "There are increasing reports of people experiencing delusions after intensive use of AI chatbots. The phenomenon, dubbed ‘AI psychosis’ has raised concerns that features built into large language models may contribute to some users losing touch with reality. Madeleine Finlay speaks to Dr Hamilton Morrin, a psychiatrist and researcher at King’s College London.", "link": "https://www.theguardian.com/science/audio/2025/aug/28/ai-psychosis-could-chatbots-fuel-delusional-thinking-podcast", "source": "Technology | The Guardian", "publication_date": "Thu, 28 Aug 2025 04:00:22 GMT"}, {"title": "Nvidia sets fresh sales record amid fears of an AI bubble and Trump’s trade wars", "summary": "Chipmaker set a fresh sales record in the second quarter, surpassing Wall Street expectations for its artificial intelligence chips. Shares of the chip giant still dropped 2.3% in after hours trading, in a sign that investors’ worries of an AI bubble are not quelled.", "link": "https://www.theguardian.com/technology/2025/aug/27/nvidia-second-quarter-earnings", "source": "Technology | The Guardian", "publication_date": "Thu, 28 Aug 2025 01:14:40 GMT"}, {"title": "Esoteric Ebb: a Dungeons & Dragons-style campaign that lets you be as stupid as you like", "summary": "Esoteric Ebb is a magical mystery from Swedish developer Christoffer Bodegård. Part tabletop game, part RPG, you play as a cleric who has been sent to investigate the destruction of a tea shop. You can choose your own path, but, much like in D&D, your success comes down to dice rolls.", "link": "https://www.theguardian.com/games/2025/aug/28/esoteric-ebb-a-dungeons-dragons-style-campaign-that-lets-you-be-as-stupid-as-you-like", "source": "Technology | The Guardian", "publication_date": "Thu, 28 Aug 2025 09:00:50 GMT"}]}