{"language": "en", "news": [{"title": "The AI boom is heralding a new gold rush in the American west", "summary": "The Tahoe-Reno Industrial Center has a sprawling landmass greater than the city of Denver. It is home to the largest datacenter in the US, built by the company Switch. Google and Microsoft have also bought land here and are constructing enormous facilities.", "link": "https://www.theguardian.com/technology/2025/dec/04/nevada-ai-data-centers", "source": "Technology | The Guardian", "publication_date": "Thu, 04 Dec 2025 12:00:19 GMT"}, {"title": "Irish authorities asked to investigate Microsoft over alleged unlawful data processing by IDF", "summary": "Irish authorities formally asked to investigate Microsoft over alleged unlawful data processing by Israeli Defense Forces. Move follows Guardian revelations of Israel’s mass surveillance of Palestinians using Microsoft cloud.", "link": "https://www.theguardian.com/technology/2025/dec/04/irish-authorities-asked-to-investigate-microsoft-over-alleged-unlawful-data-processing-by-idf", "source": "Technology | The Guardian", "publication_date": "Thu, 04 Dec 2025 14:59:39 GMT"}, {"title": "‘I don’t take no for an answer’: how a small group of women changed the law on deepfake porn", "summary": "The new Data (Use and Access) Act, which criminalises intimate image abuse, is a huge victory won fast in a space where progress is often glacially slow. For Jodie*, watching the conviction of her best friend, and knowing she helped secure it, felt at first like a kind of victory.", "link": "https://www.theguardian.com/society/ng-interactive/2025/dec/04/i-dont-take-no-for-an-answer-how-a-small-group-of-women-changed-the-law-on-deepfake-porn", "source": "Technology | The Guardian", "publication_date": "Thu, 04 Dec 2025 10:00:10 GMT"}, {"title": "Pornography company fined £1m by Ofcom for not having strong enough age checks", "summary": "Belize-based AVS Group has been hit with the punishment, plus a further £50,000 for failing to respond to information requests. It has 72 hours to make changes required by UK's Online Safety Act.", "link": "https://www.theguardian.com/society/2025/dec/04/pornography-site-fined-1m-for-not-having-strong-age-checks-required-in-new-uk-law", "source": "Technology | The Guardian", "publication_date": "Thu, 04 Dec 2025 08:38:53 GMT"}, {"title": "Thirsty work: how the rise of massive datacentres strains Australia’s drinking water supply", "summary": "The demand for use in cooling in Sydney alone is expected to exceed the volume of Canberra’s total drinking water within the next decade. As Australia rides the AI boom with dozens of new investments in datacentres in Sydney and Melbourne, experts are warning about the impact.", "link": "https://www.theguardian.com/environment/2025/dec/04/thirsty-work-how-the-rise-of-massive-datacentres-strains-australias-drinking-water-supply", "source": "Technology | The Guardian", "publication_date": "Thu, 04 Dec 2025 14:00:24 GMT"}]}