{"language": "en", "news": [{"title": "‘It’s going much too fast’: the inside story of the race to create the ultimate AI", "summary": "In Silicon Valley, rival companies are spending trillions of dollars to reach a goal that could change humanity – or potentially destroy it. These commuters are foot soldiers in the global race towards artificial general intelligence.", "link": "https://www.theguardian.com/technology/ng-interactive/2025/dec/01/its-going-much-too-fast-the-inside-story-of-the-race-to-create-the-ultimate-ai", "source": "Technology | The Guardian", "publication_date": "Mon, 01 Dec 2025 10:00:31 GMT"}, {"title": "‘It was extremely pornographic’: Cara Hunter on the deepfake video that nearly ended her political career", "summary": "Irish politician Cara Hunter was targeted in 2022, in the final weeks of her run for office. She has never found out who made the malicious deepfake, but knew immediately she had to try to stop this happening to other women.", "link": "https://www.theguardian.com/society/ng-interactive/2025/dec/01/it-was-extremely-pornographic-cara-hunter-on-the-deepfake-video-that-nearly-ended-her-political-career", "source": "Technology | The Guardian", "publication_date": "Mon, 01 Dec 2025 05:00:25 GMT"}, {"title": "James Cameron says AI actors are ‘horrifying to me’", "summary": "Cameron was speaking to CBS on Sunday Morning in the run-up to the release of the third Avatar film, subtitled Fire and Ash. He was asked about the pioneering technology he used in his film-making. Cameron expressed his disdain for artificial intelligence.", "link": "https://www.theguardian.com/film/2025/dec/01/james-cameron-says-ai-actors-are-horrifying-to-me", "source": "Technology | The Guardian", "publication_date": "Mon, 01 Dec 2025 14:21:39 GMT"}, {"title": "The 29+ best US Black Friday and Cyber Monday travel deals on luggage, backpacks, travel adapters and more", "summary": "From Away, Calpak and Samsonite, here are budget-friendly reasons to upgrade your luggage, replace your headphones and finally invest in a set of packing cubes The 65+ very best US Black Friday and Cyber Monday deals, curated and vetted.", "link": "https://www.theguardian.com/thefilter-us/2025/nov/18/best-black-friday-cyber-monday-travel-deals", "source": "Technology | The Guardian", "publication_date": "Mon, 01 Dec 2025 12:16:41 GMT"}, {"title": "The 20+ best US Black Friday and Cyber Monday tech deals on TVs, tablets, phones, smart watches and more", "summary": "Black Friday and Cyber Monday is a great time to pick up some great deals. But it's also a chance to get some nice, deeply discounted goodies for yourself. This is especially true in the world of tech, where high prices and personal taste mean it's often just safest to buy what works for you.", "link": "https://www.theguardian.com/thefilter-us/2025/nov/19/best-black-friday-cyber-monday-tech-deals", "source": "Technology | The Guardian", "publication_date": "Mon, 01 Dec 2025 12:16:36 GMT"}, {"title": "The best UK Cyber Monday and Black Friday deals on the products we love, from video doorbells to heated throws", "summary": "Black Friday is behind us, but there are still plenty of Cyber Monday bargains. Shark’s CryoGlow LED mask and a cordless vacuum are among the best deals.", "link": "https://www.theguardian.com/thefilter/2025/nov/27/best-black-friday-deals-uk-2025-filter-tested-recommended", "source": "Technology | The Guardian", "publication_date": "Mon, 01 Dec 2025 12:00:45 GMT"}]}