{"language": "en", "news": [{"title": "‘A step-change’: tech firms battle for undersea dominance with submarine drones", "summary": "Navies around the world are racing to add autonomous submarines. The UK’s Royal Navy is planning a fleet of underwater uncrewed vehicles (UUVs) Australia has committed to spending $1.7bn (£1.3bn) on ‘Ghost Shark’ submarines.", "link": "https://www.theguardian.com/business/2025/nov/28/tech-submarine-drones-startups-big-defence-companies", "source": "Technology | The Guardian", "publication_date": "Fri, 28 Nov 2025 06:00:59 GMT"}, {"title": "More than 1,000 Amazon workers warn rapid AI rollout threatens jobs and climate", "summary": "More than 1,000 Amazon employees have signed an open letter expressing ‘serious concerns’ about AI development. Workers say the firm’s ‘warp-speed’ approach fuels pressure, layoffs and rising emissions.", "link": "https://www.theguardian.com/technology/2025/nov/28/amazon-ai-climate-change", "source": "Technology | The Guardian", "publication_date": "Fri, 28 Nov 2025 13:50:15 GMT"}, {"title": "One in 10 UK parents say their child has been blackmailed online, NSPCC finds", "summary": "One in 10 UK parents say their child has been blackmailed online. Harms include threats to release intimate pictures. NSPCC warns against parents sharing photos or details of children online.", "link": "https://www.theguardian.com/technology/2025/nov/28/one-in-10-uk-parents-say-child-blackmailed-online-sextortion-nspcc-finds", "source": "Technology | The Guardian", "publication_date": "Fri, 28 Nov 2025 06:00:58 GMT"}, {"title": "How to avoid bad Black Friday laptop deals – and some of the best UK offers for 2025", "summary": "Black Friday deals have started, and if you’ve been on the lookout for a good price on a new laptop, then this could be your lucky day. But with so many websites being shouty about their Black Friday offers, the best buys aren’t always easy to spot. So before you splash the cash, it might pay to do some research – and look closely at the specification. Buy the right laptop today and you can look forward to many years of joyful productivity", "link": "https://www.theguardian.com/thefilter/2025/nov/28/best-black-friday-laptop-deals-cyber-monday-uk-2025", "source": "Technology | The Guardian", "publication_date": "Fri, 28 Nov 2025 17:31:26 GMT"}, {"title": "The best Black Friday TV deals in the UK – and how to avoid a bad one", "summary": "We've rounded up the best Black Friday TV deals for every budget. From 50in OLEDs and small smart TVs to top-rated brands. Do you really need to buy a new TV?", "link": "https://www.theguardian.com/thefilter/2025/nov/28/best-black-friday-tv-deals-cyber-monday-uk-2025", "source": "Technology | The Guardian", "publication_date": "Fri, 28 Nov 2025 16:11:20 GMT"}, {"title": "After a teddy bear talked about kink, AI watchdogs are warning parents against smart toys", "summary": "Advocates are fighting against the $16.7bn global smart-toy market. They decry surveillance and a lack of regulation. The trend has prompted calls for increased testing of such products.", "link": "https://www.theguardian.com/technology/2025/nov/28/artificial-intelligence-smart-toys", "source": "Technology | The Guardian", "publication_date": "Fri, 28 Nov 2025 13:00:07 GMT"}, {"title": "The best Black Friday 2025 deals in the UK on the products we love: coffee machines, board games and heated airers", "summary": "Black Friday has long since ceased to be a mere ‘day’ Products that have been discounted throughout November have been given even more tempting offers. There are still plenty of savings available to shop and, crucially, there’s lots of time left to mull over your decision.", "link": "https://www.theguardian.com/thefilter/2025/nov/27/best-black-friday-deals-uk-2025-filter-tested-recommended", "source": "Technology | The Guardian", "publication_date": "Fri, 28 Nov 2025 12:41:56 GMT"}, {"title": "My family’s excitement about Outer Worlds 2 was short-lived | Dominik Diamond", "summary": "The original Outer Worlds dazzled our eyeballs with its art nouveau palette. It charmed our ears with witty dialogue, sucking us into a classic mystery-unravelling story. My wife did not play The Outer Worlds, because none of those worlds featured Crash Bandicoot.", "link": "https://www.theguardian.com/games/2025/nov/28/my-familys-excitement-about-outer-worlds-2-was-short-lived-but-at-least-we-bonded-over-the-disappointment", "source": "Technology | The Guardian", "publication_date": "Fri, 28 Nov 2025 12:00:08 GMT"}]}