{"language": "en", "news": [{"title": "Smoking avatars and online games: how big tobacco targets young people in the metaverse", "summary": "Cigarettes and vapes are being smuggled into virtual spaces beyond the reach of regulation. Virtual online spaces are becoming a new marketing battleground as tobacco and alcohol promoters target young people.", "link": "https://www.theguardian.com/global-development/2025/jul/22/avatar-smokes-big-tobacco-children-metaverse-cigarettes-vapes-virtual-regulation-health", "source": "Technology | The Guardian", "publication_date": "Tue, 22 Jul 2025 07:00:47 GMT"}, {"title": "UK border officials to use AI to verify ages of child asylum seekers", "summary": "Trial of technology comes as official report warns existing system has been failing for at least a decade. Officials are to start using artificial intelligence to help estimate the age of asylum seekers who say they are children.", "link": "https://www.theguardian.com/uk-news/2025/jul/22/uk-border-officials-to-use-ai-to-verify-ages-of-child-asylum-seekers", "source": "Technology | The Guardian", "publication_date": "Tue, 22 Jul 2025 14:24:19 GMT"}, {"title": "Silicon Valley trades researchers like football teams poach players", "summary": "Big tech is offering athlete-level pay to lure AI researchers in a high-stakes race for dominance. Tech companies are tasking the star players of their AI squads with developing technology that can outperform humans in any task.", "link": "https://www.theguardian.com/technology/2025/jul/21/silicon-valley-trades-researchers-like-football-teams-poach-players", "source": "Technology | The Guardian", "publication_date": "Tue, 22 Jul 2025 13:13:43 GMT"}, {"title": "The best kettles to save energy and speed up your cuppa, tested", "summary": "Not all electric kettles are created equal. We boiled litres of water to find the best. From hard-water heroes to vintage-style, repairable and wi-fi connected models.", "link": "https://www.theguardian.com/thefilter/2025/jul/22/best-electric-kettles-uk", "source": "Technology | The Guardian", "publication_date": "Tue, 22 Jul 2025 14:17:25 GMT"}]}