{"language": "en", "news": [{"title": "UK Online Safety Act risks ‘seriously infringing’ free speech, says X", "summary": "Elon Musk’s social media platform says lawmakers made a ‘conscientious decision’ to increase censorship. Online Safety Act (OSA) is at risk of ‘seriously infringing’ free speech.", "link": "https://www.theguardian.com/technology/2025/aug/01/uk-online-safety-act-free-speech-x-elon-musk", "source": "Technology | The Guardian", "publication_date": "Fri, 01 Aug 2025 17:06:28 GMT"}, {"title": "Aamir Khan: India’s movie legend on a cut-price mission to save Bollywood", "summary": "The superstar actor will release his latest film on YouTube so families who cannot afford cinema trips can watch. Indian cinema is widely adored and has an outsized influence on society but just 2-3% of its 1.4 billion people go to the cinema.", "link": "https://www.theguardian.com/film/2025/aug/01/aamir-khan-indian-movie-legend-mission-save-bollywood", "source": "Technology | The Guardian", "publication_date": "Fri, 01 Aug 2025 04:00:15 GMT"}, {"title": "Go-to entertainment: why gaming was made for the toilet", "summary": "There’s no shame any more, and no better place to lose yourself and the world with a few quiet rounds of Pocket Card Jockey or Marvel Snap than in the quiet of the privy. I realise this may not be the most ‘Guardian’ of Guardian article openings, but we all use the toilet and we all play games; I am merely providing a Venn diagram.", "link": "https://www.theguardian.com/games/2025/aug/01/gaming-was-made-for-the-toilet", "source": "Technology | The Guardian", "publication_date": "Fri, 01 Aug 2025 11:00:23 GMT"}, {"title": "Punch bags, penny pushers and Hillbilly shootouts: the 10 best classic seaside arcade machines", "summary": "A trip to the seaside isn’t complete without a jangling cup of 2p coins or an overconfident uncle nursing a sore hand. As a child of the 1980s, coin-op video games were an obsession. Here are 10 of the best – please add your own in the comments.", "link": "https://www.theguardian.com/games/2025/aug/01/10-best-classic-seaside-arcade-machines", "source": "Technology | The Guardian", "publication_date": "Fri, 01 Aug 2025 08:00:20 GMT"}]}