{"language": "en", "news": [{"title": "Anti-immigrant material among AI-generated content getting billions of views on TikTok", "summary": "Researchers uncovered 354 AI-focused accounts that had accumulated 4.5bn views in a month. Hundreds of accounts on TikTok are garnering billions of views by pumping out AI-generated content.", "link": "https://www.theguardian.com/technology/2025/dec/03/anti-immigrant-material-among-ai-generated-content-getting-billions-of-views-on-tiktok", "source": "Technology | The Guardian", "publication_date": "Wed, 03 Dec 2025 06:00:57 GMT"}, {"title": "YouTube says it will comply with Australia’s under-16s social media ban, with Lemon8 to also restrict access", "summary": "YouTube will comply with the federal government’s under-16s social media ban. But its parent company Google has warned the laws ‘won’t keep teens safer online’ The communications minister, Anika Wells, said YouTube had a responsibility to keep its platform safe.", "link": "https://www.theguardian.com/australia-news/2025/dec/02/australian-children-moving-to-new-social-app-lemon8-but-owner-expected-to-restrict-users-to-over-16s", "source": "Technology | The Guardian", "publication_date": "Wed, 03 Dec 2025 05:49:50 GMT"}, {"title": "India revokes order to preload smartphones with state-owned security app", "summary": "India's government has backtracked on an order for all smartphones to be pre-installed with a state-owned security app. Tech companies including Apple and Google made it clear they would not comply due to privacy concerns.", "link": "https://www.theguardian.com/world/2025/dec/03/india-revokes-order-pre-load-smartphones-state-owned-security-app-sanchar-saathi-", "source": "Technology | The Guardian", "publication_date": "Wed, 03 Dec 2025 13:53:04 GMT"}, {"title": "Tesla privately warned UK that weakening EV rules would hit sales", "summary": "Elon Musk-owned electric carmaker also called for support for the secondhand market, documents reveal. Tesla privately warned the UK government that weakening electric vehicle rules would hit battery car sales.", "link": "https://www.theguardian.com/technology/2025/dec/03/tesla-uk-ev-rules-sales-elon-musk-electric-car", "source": "Technology | The Guardian", "publication_date": "Wed, 03 Dec 2025 06:00:56 GMT"}, {"title": "Dan Houser on Victorian novels, Red Dead Redemption and redefining open-world games", "summary": "Dan Houser is the co-founder of Rockstar and lead writer on Grand Theft Auto and Red Dead Redemption. He has been in London to talk about his new company, Absurd Ventures. He’s working on a range of intriguing projects, including the novel and podcast series A Better Paradise.", "link": "https://www.theguardian.com/games/2025/dec/03/i-binged-on-victorian-novels-dan-houser-on-dickens-red-dead-redemption-and-redefining-open-world-games", "source": "Technology | The Guardian", "publication_date": "Wed, 03 Dec 2025 15:00:47 GMT"}, {"title": "Sleep Awake review – Gary Numan cameos in an overly straightforward sleep-deprivation horror", "summary": "Psychedelic visuals and a promising premise are let down by tired game design. First-person horror with an appearance from the synthpop pioneer Gary Numan.", "link": "https://www.theguardian.com/games/2025/dec/03/sleep-awake-review-gary-numan-cameos-in-an-overly-straightforward-sleep-deprivation-horror", "source": "Technology | The Guardian", "publication_date": "Wed, 03 Dec 2025 10:00:29 GMT"}]}