{"language": "en", "news": [{"title": "Consumers told to check freezers and not eat meals affected by listeria recall", "summary": "Families have been urged by the food safety watchdog to check their freezers and throw out “implicated” ready-meal products following an outbreak of listeria in which one person has died.", "link": "https://www.independent.ie/irish-news/consumers-told-to-check-freezers-and-not-eat-meals-affected-by-listeria-recall/a871988659.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}, {"title": "All Star Niall Gilligan assault case: An uncomfortable tale involving a child in the wrong place and a man let down by rural decay", "summary": "By all accounts, the jurors did what they were supposed to do. They listened, they weighed up the evidence and they returned the only verdict they reasonably could. The law hadn't asked them to decide if Niall Gilligan was perfect.", "link": "https://www.independent.ie/opinion/comment/all-star-niall-gilligan-assault-case-an-uncomfortable-tale-involving-a-child-in-the-wrong-place-and-a-man-let-down-by-rural-decay/a1992055541.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}, {"title": "Nine Irish to start Lions second Test but Garry Ringrose misses out with concussion", "summary": "Andy Farrell has named nine Irish players in his starting XV for the second Test against Australia at the 100,000-capacity Melbourne Cricket Ground, but it would have been 10 had Garry Ringrose not self reported a concussion after training.", "link": "https://www.independent.ie/sport/rugby/nine-irish-to-start-lions-second-test-but-garry-ringrose-misses-out-with-concussion/a2039207988.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 07:08:46 +0200"}, {"title": "Donald Trump’s Japanese trade triumph is bad news for Ireland and the rest of Europe", "summary": "Donald Trump’s trade deal with Japan is a triumph for his tariff agenda. It’s also a victory for his strategy of strong-arming ‘partners’ into bad deals trading on their unwillingness to risk facing into something even worse by rejecting his bruisingly tough terms.", "link": "https://www.independent.ie/business/world/donald-trumps-japanese-trade-triumph-is-bad-news-for-ireland-and-the-rest-of-europe/a304885231.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}, {"title": "Oliver Callan: Why a lovely local Pride has me agreeing with Denis O’Brien on expelling flaky foreign investors", "summary": "It seems only yesterday that I was reading rage letters from his lawyers about mean things I said about him on the telly. Now he’s talking sense. Mentally high-fiving Big Dinny is like a Monaghan man shouting for Cavan at an Ulster final – ’tis unnatural.", "link": "https://www.independent.ie/opinion/comment/oliver-callan-why-a-lovely-local-pride-has-me-agreeing-with-denis-obrien-on-expelling-flaky-foreign-investors/a1904997193.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}, {"title": "‘I started looking when I was three months’ pregnant and was told there’s a two-year waiting list’ – counting the true cost of childcare", "summary": "For parents like Aoife Whelan, a mother-of-two living in Sallins, Co Kildare, Ireland’s childcare crisis begins before their child is even born. “I had to take a full year off for my first baby, as there was no childcare available after my maternity leave finished.", "link": "https://www.independent.ie/opinion/comment/i-started-looking-when-i-was-three-months-pregnant-and-was-told-theres-a-two-year-waiting-list-counting-the-true-cost-of-childcare/a1839753936.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}, {"title": "‘My sister does her fake tan religiously every Thursday night’: Irish women on their love of self tan", "summary": "The long-range forecast for Fiona Brown’s upcoming family summer holiday in France is showing sun and temperatures in the high 20s, but the possibility of coming home with a tan is the furthest thing from her mind – she’s already leaving with one.", "link": "https://www.independent.ie/life/my-sister-does-her-fake-tan-religiously-every-thursday-night-irish-women-on-their-love-of-self-tan/a1569049205.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}, {"title": "Restaurant review: ‘Overall I am disappointed by the food, which simply doesn’t pack as much flavour as it should’", "summary": "Galway International Arts Festival is the busiest two weeks of the year in the city. Shop Street is thronged with luvvies who haven’t seen each other in a while.", "link": "https://www.independent.ie/life/food-drink/food-reviews/restaurant-review-overall-i-am-disappointed-by-the-food-which-simply-doesnt-pack-as-much-flavour-as-it-should/a229081046.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}, {"title": "Elon Musk’s X threatened by Irish regulator for failure to restrict adult content", "summary": "The Irish media regulator, Coimisiún na Meán, says that Elon Musk’s X has until tomorrow to explain why it isn’t preventing children from watching pornography, or it will face “action”.", "link": "https://www.independent.ie/business/technology/elon-musks-x-threatened-by-irish-regulator-for-failure-to-restrict-adult-content/a1667248676.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}, {"title": "The Irish Independent’s View: No child should beg for heaven to escape hunger hell in Gaza", "summary": "At other dark periods in world history, the shutters were pulled down on mass suffering. What makes the starvation of infants and unending carnage among civilians in Gaza so exceptional is that it is being watched through an open window, and still nothing is done internationally.", "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-no-child-should-beg-for-heaven-to-escape-hunger-hell-in-gaza/a1495007682.html", "source": "Irish Independent : Independent", "publication_date": "Thu, 24 Jul 2025 06:30:00 +0200"}]}