{"language": "en", "news": [{"title": "What are the new UK online safety rules and how will age checks on adult content be enforced?", "summary": "From 25 July websites and apps will be required to protect children by filtering out harmful content. It is a significant test for the Online Safety Act, a landmark piece of legislation.", "link": "https://www.theguardian.com/technology/2025/jul/24/what-are-the-new-uk-online-safety-rules-and-how-will-they-be-enforced", "source": "Technology | The Guardian", "publication_date": "Thu, 24 Jul 2025 12:53:16 GMT"}, {"title": "AI summaries cause ‘devastating’ drop in audiences, online news media told", "summary": "Study claims sites previously ranked first can lose 79% of traffic if results appear below Google Overview. Threat posed by Google’s AI Overviews has risen to the top of the concerns among media owners.", "link": "https://www.theguardian.com/technology/2025/jul/24/ai-summaries-causing-devastating-drop-in-online-news-audiences-study-finds", "source": "Technology | The Guardian", "publication_date": "Thu, 24 Jul 2025 09:02:56 GMT"}, {"title": "UK student jailed for selling phishing kits linked to £100m of fraud", "summary": "Ollie Holman created phishing kits that mimicked government, bank and charity websites so that criminals could harvest victims’ personal information. 21-year-old student designed and distributed online kits linked to £100m worth of fraud.", "link": "https://www.theguardian.com/technology/2025/jul/24/canterbury-student-phishing-kits-jailed-fraudsters", "source": "Technology | The Guardian", "publication_date": "Thu, 24 Jul 2025 12:46:41 GMT"}, {"title": "Khruangbin, again? I quit Spotify for a month to escape samey algorithms – this is what I learned", "summary": "Spotify’s algorithm has anaesthetised artists I once enjoyed. Every time I hear the slippery psychedelic bass of Khruangbin slinking into one of my playlists, I violently hit skip. The problem with this listening experience isn’t just the creepy AI-driven intimacy of it all, more that the same songs are recycled.", "link": "https://www.theguardian.com/music/2025/jul/25/i-quit-spotify-for-a-month-this-is-what-i-learned-about-algorithms-narrowing-taste-serendipity", "source": "Technology | The Guardian", "publication_date": "Thu, 24 Jul 2025 15:00:33 GMT"}]}