{"language": "en", "news": [{"title": "Google announces £5bn AI investment in UK before Trump visit", "summary": "Google will invest £5bn in the UK in the next two years to meet demand for artificial intelligence services. The investment comes as Google opens its new datacentre in Waltham Cross in Hertfordshire. It is expected to contribute to the creation of thousands of jobs.", "link": "https://www.theguardian.com/technology/2025/sep/16/google-ai-investment-uk-trump-visit-rachel-reeves", "source": "Technology | The Guardian", "publication_date": "Tue, 16 Sep 2025 07:00:40 GMT"}, {"title": "‘I have to do it’: Why one of the world’s most brilliant AI scientists left the US for China", "summary": "Song-Chun Zhu grew up in a village supply store in rural China. He became obsessed with what people left behind after they died. In 2020, after spending half his life in the US, he took a one-way ticket to China.", "link": "https://www.theguardian.com/news/ng-interactive/2025/sep/16/song-chun-zhu-why-one-of-the-worlds-most-brilliant-ai-scientists-left-the-us-for-china", "source": "Technology | The Guardian", "publication_date": "Tue, 16 Sep 2025 04:00:27 GMT"}, {"title": "‘I love you too!’ My family’s creepy, unsettling week with an AI toy", "summary": "Grem is an AI-powered stuffed alien toy that the musician Claire Boucher, better known as Grimes, helped develop with toy company Curio. Designed for kids aged three and over and built with OpenAI’s technology, the toy is supposed to ‘learn’ your child’'s personality. Every conversation they have is recorded, then transcribed by a third party.", "link": "https://www.theguardian.com/technology/2025/sep/16/i-love-you-too-my-familys-creepy-unsettling-week-with-an-ai-toy", "source": "Technology | The Guardian", "publication_date": "Tue, 16 Sep 2025 04:00:27 GMT"}, {"title": "Jaguar Land Rover extends production shutdown after cyber-attack", "summary": "Jaguar Land Rover says it will freeze production until at least next Wednesday, 24 September. Carmaker continues its investigations into the hack, which first emerged earlier this month.", "link": "https://www.theguardian.com/business/2025/sep/16/jaguar-land-rover-production-shutdown-cyber-attack", "source": "Technology | The Guardian", "publication_date": "Tue, 16 Sep 2025 08:04:39 GMT"}, {"title": "To understand how AI will reconfigure humanity, try this German fairytale | Clemens J Setz", "summary": "Artificial intelligence will replace creativity with something closer to magical wishing. The challenge for future generations will be dealing with the feeling of emptiness that leaves us with a wish.", "link": "https://www.theguardian.com/books/2025/sep/16/ai-artificial-intelligence-fairytale-fisherman", "source": "Technology | The Guardian", "publication_date": "Tue, 16 Sep 2025 06:00:00 GMT"}, {"title": "How I brew cafe-quality coffee anywhere, from campsite to carry-on", "summary": "Coffee makes me feel more settled in the morning. I've spent the past few years perfecting my travel coffee setup. It's so I can make rich, comforting, homey coffee anywhere in the world.", "link": "https://www.theguardian.com/food/2025/sep/16/how-to-brew-coffee-on-the-go", "source": "Technology | The Guardian", "publication_date": "Tue, 16 Sep 2025 11:00:05 GMT"}]}