{"language": "en", "news": [{"title": "Siri-us setback: Apple’s AI chief steps down as company lags behind rivals", "summary": "Apple's head of artificial intelligence, John Giannandrea, is stepping down from the company. The move comes as the Silicon Valley giant has lagged behind its competitors in rolling out generative AI features, in particular its voice assistant Siri. Tim Cook, Apple's CEO, said his fellow executive helped the company ‘in building and advancing our AI work’", "link": "https://www.theguardian.com/technology/2025/dec/01/apple-ai-chief-john-giannandrea-steps-down", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 00:51:31 GMT"}, {"title": "Charlie Kirk tops Wikipedia’s list of most-read articles in 2025", "summary": "Wikipedia’s article on Charlie Kirk was the most read on the online encyclopedia this year. People viewed the entry on Kirk nearly 45m times, many after he was shot at a university campus debate. Zohran Mamdani, Ozzy Osbourne and Sinners also feature in encyclopedia's top 20 most-read English-language pages.", "link": "https://www.theguardian.com/technology/2025/dec/02/charlie-kirk-wikipedia-list-most-read-articles-in-2025", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 12:00:31 GMT"}, {"title": "The rise of deepfake pornography in schools: ‘One girl was so horrified she vomited’", "summary": "Hundreds of teachers have seen images created by pupils, often of their peers. The fallout is huge – and growing fast. ‘It worries me that it’s so normalised. He obviously wasn’t hiding it. It was in the open and people saw it.’", "link": "https://www.theguardian.com/society/ng-interactive/2025/dec/02/the-rise-of-deepfake-pornography-in-schools", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 10:00:28 GMT"}, {"title": "‘The Chinese will not pause’: Volvo and Polestar bosses urge EU to stick to 2035 petrol car ban", "summary": "Two Swedish car companies, Volvo and Polestar, are leading the campaign. They argue such a move is a desperate attempt to paper over the cracks in the German car industry.", "link": "https://www.theguardian.com/business/2025/dec/02/china-volvo-polestar-eu-2035-petrol-car-sweden-germany", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 06:00:19 GMT"}, {"title": "From Gears of War to Uno: the 15 most important Xbox 360 games", "summary": "As the Xbox 360 turns 20, we celebrate its most influential and memorable games – both exclusives, and those that came to the console first.", "link": "https://www.theguardian.com/games/2025/dec/02/the-15-most-important-xbox-360-games", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 10:00:27 GMT"}]}