{"language": "en", "news": [{"title": "UK may back down on demand for backdoor access to Apple users’ encrypted data", "summary": "Government sources say pressure from Washington, including JD Vance, could lead to Home Office climbdown. In January, the UK Home Office formally asked Apple to provide law enforcement agencies access to heavily encrypted data held on behalf of its customers. But the US company resisted and withdrew its advanced data protection service from the UK market.", "link": "https://www.theguardian.com/technology/2025/jul/21/uk-demand-backdoor-access-apple-users-encrypted-data", "source": "Technology | The Guardian", "publication_date": "Mon, 21 Jul 2025 10:56:38 GMT"}, {"title": "Meta allows ads crowdfunding for IDF drones, consumer watchdog finds", "summary": "Paid ads hosted on Facebook, Instagram and Threads seem to violate Meta’s stated policies yet remain active. “We are the sniper team of Unit Shaked, stationed in Gaza, and we urgently need shooting tripods,” one ad on Facebook read.", "link": "https://www.theguardian.com/technology/2025/jul/21/meta-idf-drone-ads-israel", "source": "Technology | The Guardian", "publication_date": "Mon, 21 Jul 2025 12:00:32 GMT"}, {"title": "Human-level AI is not inevitable. We have the power to change course | Garrison Lovely", "summary": "Technology happens because people make it happen. We can choose otherwise “Technology happens because it is possible,” OpenAI CEO, Sam Altman,  told  the New York Times in 2019, consciously paraphrasing Robert Oppenheimer, the father of the atomic bomb. Altman captures a Silicon Valley mantra: technology marches forward inexorably.   Continue reading...", "link": "https://www.theguardian.com/commentisfree/ng-interactive/2025/jul/21/human-level-artificial-intelligence", "source": "Technology | The Guardian", "publication_date": "Mon, 21 Jul 2025 14:00:34 GMT"}, {"title": "Has Elon Musk built a Nazi chatbot? – podcast", "summary": "Elon Musk launched Grok, an AI chatbot marketed as providing ‘unfiltered answers’ In part, it was reportedly created to counter other machines that Musk saw as being trained to be ‘politically correct’ Fast forward to 2025 and Grok is no stranger to controversy – sharing antisemitic content and conspiracy theories.", "link": "https://www.theguardian.com/news/audio/2025/jul/21/has-elon-musk-built-a-nazi-chatbot-grok-x-ai-podcast", "source": "Technology | The Guardian", "publication_date": "Mon, 21 Jul 2025 02:00:06 GMT"}, {"title": "Tea in the microwave? Why gen Z are giving up on kettles to make a brew", "summary": "Two-thirds of UK under-30s have used a microwave to make a cuppa, and one in six say they do it every day … Name:  Kettles. Age:  132. First featured in a catalogue in 1893.   Continue reading...", "link": "https://www.theguardian.com/food/2025/jul/21/tea-in-the-microwave-why-gen-z-are-giving-up-on-kettles-to-make-a-brew", "source": "Technology | The Guardian", "publication_date": "Mon, 21 Jul 2025 16:25:07 GMT"}, {"title": "Leftists are determined to date each other - and not settle for liberals: ‘Politics are the new religion’", "summary": "Zohran Mamdani met his wife, Rama Duwaji, through Hinge. “There is still hope on those dating apps,” he said on the Bulwark podcast a week before his stunning victory.", "link": "https://www.theguardian.com/lifeandstyle/2025/jul/21/dating-apps-politics-liberal-progressive", "source": "Technology | The Guardian", "publication_date": "Mon, 21 Jul 2025 11:00:16 GMT"}]}