{
    "language": "en",
    "news": [
        {
            "title": "Google Pixel 10 Pro review: one of the very best smaller phones",
            "summary": "Top-spec cameras, cutting edge AI, great software and stunning screen squeezed into a more manageable frame The Pixel 10 Pro is Google’s best phone that is still a pocketable, easy-to-handle size, taking the excellent Pixel 10 and beefing it up in the camera department. That makes it a contender for the top smaller phone with Apple’s iPhone 17 Pro, offering the best of Google’s hardware without an enormous screen. It is also the cheapest of three Pixel 10 Pro phones starting at £999 (€1,099/$999/A$1,699) sitting below the bigger 10 Pro XL and the tablet-phone hybrid the 10 Pro Fold.   Continue reading...",
            "link": "https://www.theguardian.com/technology/2025/sep/15/google-pixel-10-pro-review-one-very-best-smaller-phones",
            "source": "Technology | The Guardian",
            "publication_date": "Mon, 15 Sep 2025 06:00:55 GMT"
        },
        {
            "title": "Tinseltown takeover: how Harry Potter fanfic has become Hollywood’s hottest property",
            "summary": "What once seemed a pretty fringe subculture of hobbyists riffing on stories that got them privately hot is now bringing mainstream cinema to a rolling boil There was a time when fan fiction meant furtive scribbles uploaded to shadowy corners of the internet, in which Mr Darcy was recast as a moody vampire flatmate, Captain Kirk discovered his inner romantic, or Gandalf finally got around to opening an artisanal shop in the Shire. It was an underground hobby that could never trouble Tinseltown’s accountants. And yet here we are in 2025, with  the news in the Hollywood Reporter  that Legendary Pictures has just paid at least $3m – (£2.2m) – an unprecedented amount – for the screen rights to a forthcoming novel called Alchemised that began life as an unauthorised and kinky Harry Potter spin-off. The backstory behind  Alchemised, by SenLinYu , sounds pretty freaky. SenLinYu’s original book, titled Manacled, inhabited a strange sub-niche of Potterverse named “Dramione” in which Hermione Granger finds herself regularly involved in unlikely and transgressive romantic encounters with Draco Malfoy. Now stripped of all reference to Hogwarts, butterbeer and Nimbus 2000s, and with renamed characters, Alchemised will hit shelves and online bookstores later this month as the dark fantasy tale of a young woman with memory problems who finds herself at the mercy of a powerful and cruel necromancer.   Continue reading...",
            "link": "https://www.theguardian.com/film/2025/sep/15/tinseltown-takeover-how-harry-potter-fanfic-has-become-hollywoods-hottest-property",
            "source": "Technology | The Guardian",
            "publication_date": "Mon, 15 Sep 2025 05:00:57 GMT"
        }
    ]
}