{"language": "en", "news": [{"title": "AI tools used by English councils downplay women’s health issues, study finds", "summary": "LSE research finds risk of gender bias in care decisions made based on AI summaries of case notes. Language such as ‘disabled’, ‘unable’ and ‘complex’ appeared significantly more often in descriptions of men than women.", "link": "https://www.theguardian.com/technology/2025/aug/11/ai-tools-used-by-english-councils-downplay-womens-health-issues-study-finds", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 05:00:42 GMT"}, {"title": "Cat soap operas and babies trapped in space: the ‘AI slop’ taking over YouTube", "summary": "Nearly one in 10 of the fastest growing YouTube channels globally consist of mass-produced, surreal AI-generated videos. Super Cat League (3.9 million subscribers), LSB POWER GAMING (1.7 million subscribers) and MIRANHAINSANO (4.9million subscribers)", "link": "https://www.theguardian.com/technology/2025/aug/11/cat-soap-operas-and-babies-trapped-in-space-the-ai-slop-taking-over-youtube", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 11:00:03 GMT"}, {"title": "Nvidia and AMD agree to pay 15% of China chip sale revenues to US", "summary": "Chipmakers agree to deal amid Trump trade war as condition for obtaining export licences for Chinese market. The move, an apparent reversal of US national security restrictions on the chip sales, signalled an easing in the US-China trade war.", "link": "https://www.theguardian.com/technology/2025/aug/10/nvidia-amd-china-chip-sale-revenues", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 11:35:44 GMT"}, {"title": "Tiny Bookshop review – a truly cosy escape made with readers in mind", "summary": "Tiny Bookshop is a resource management simulator set in a retail or service environment. Real titles from Shakespeare to John Green line the shelves of your seaside shop in a rhythmic, mellow management simulator.", "link": "https://www.theguardian.com/games/2025/aug/11/tiny-bookshop-review", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 09:00:48 GMT"}]}