{"language": "en", "news": [{"title": "Google inks $3bn US hydropower deal as it expands energy-hungry datacenters", "summary": "Tech giant will buy 3GW of US hydropower in deal to fuel AI and data center growth across eastern states. The deal between  Google  and Brookfield Asset Management includes initial 20-year power purchase agreements.", "link": "https://www.theguardian.com/technology/2025/jul/16/google-hydropower-deal-clean-energy", "source": "Technology | The Guardian", "publication_date": "Wed, 16 Jul 2025 15:22:20 GMT"}, {"title": "WeTransfer says user content will not be used to train AI after backlash", "summary": "New terms of service suggested uploaded files could be used to ‘improve machine learning models’ Firm is regularly used by creative professionals to transfer their work online.", "link": "https://www.theguardian.com/technology/2025/jul/16/wetransfer-user-content-ai-artificial-intelligence", "source": "Technology | The Guardian", "publication_date": "Wed, 16 Jul 2025 15:05:19 GMT"}, {"title": "Nothing Phone 3 review: a quirky, slick Android alternative", "summary": "London-based Nothing has launched its first high-end Android phone in several years. The Phone 3 has a unique design on the back that includes a small, unique LED screen. It also has slick, dot-matrix-inspired software and a unique colour scheme.", "link": "https://www.theguardian.com/technology/2025/jul/16/nothing-phone-3-review-a-quirky-slick-android-alternative", "source": "Technology | The Guardian", "publication_date": "Wed, 16 Jul 2025 06:00:40 GMT"}, {"title": "Apple inks $500m deal for rare earth magnets with US mining firm", "summary": "Apple has signed a $500m deal with a US firm for rare earth magnets. Comes after China curbed exports of the scarce, vital materials. MP Materials, which operates the only US rare earths mine, last week agreed a multibillion-dollar deal with the US Department of Defense.", "link": "https://www.theguardian.com/technology/2025/jul/16/apple-us-mining-deal-magnets", "source": "Technology | The Guardian", "publication_date": "Wed, 16 Jul 2025 12:57:10 GMT"}, {"title": "Top Bananza! Donkey Kong’s long-awaited return is a literal smash-hit", "summary": "Donkey Kong Bananza is Donkey Kong's first standalone adventure in 11 years. Employing a similar voxel-based technology to Minecraft, DK's Switch 2 adventure swaps the former’s thoughtful Lego-esque world-building for gleeful destruction.", "link": "https://www.theguardian.com/games/2025/jul/16/top-bananza-donkey-kongs-long-awaited-return-is-a-literal-smash-hit", "source": "Technology | The Guardian", "publication_date": "Wed, 16 Jul 2025 14:00:12 GMT"}, {"title": "Donkey Kong Bananza review - delirious destruction derby takes hammer to platforming conventions", "summary": "Donkey Kong Bananza is Nintendo’s first major single-player Switch 2 game. It will set the quality bar for the console in the way Breath of the Wild did when the original Switch was released. But as the latest game from the team responsible for the exceptional 3D Mario series, it is already begrudged by some Nintendo fans as a distraction.", "link": "https://www.theguardian.com/games/2025/jul/16/donkey-kong-bananza-review-nintendo-switch-2", "source": "Technology | The Guardian", "publication_date": "Wed, 16 Jul 2025 12:00:09 GMT"}]}