{"language": "en", "news": [{"title": "‘We could have asked ChatGPT’: students fight back over course taught by AI", "summary": "Staffordshire students say signs material was AI-generated included suspicious file names and rogue voiceover accent. James and Owen were among 41 students who took a coding module at Staffordshire last year, hoping to change careers.", "link": "https://www.theguardian.com/education/2025/nov/20/university-of-staffordshire-course-taught-in-large-part-by-ai-artificial-intelligence", "source": "Technology | The Guardian", "publication_date": "Thu, 20 Nov 2025 11:18:54 GMT"}, {"title": "French authorities investigate alleged Holocaust denial posts on Elon Musk’s Grok AI", "summary": "French public prosecutors are investigating allegations by government ministers and human rights groups that Grok made statements denying the Holocaust. The Paris public prosecutor’s office said on Wednesday night it was expanding an existing inquiry into Musk's social media platform X.", "link": "https://www.theguardian.com/technology/2025/nov/20/french-authorities-look-into-holocaust-denial-posts-elon-musk-grok-ai", "source": "Technology | The Guardian", "publication_date": "Thu, 20 Nov 2025 14:09:25 GMT"}, {"title": "‘We excel at every phase of AI’: Nvidia CEO quells Wall Street fears of AI bubble amid market selloff", "summary": "Global share markets rose after Nvidia posted third-quarter earnings that beat Wall Street estimates. The results assuaged for now concerns about whether the high-flying valuations of AI firms had peaked. Jensen Huang opens earnings call with attempt to dispel concerns.", "link": "https://www.theguardian.com/technology/2025/nov/19/nvidia-earning-report", "source": "Technology | The Guardian", "publication_date": "Thu, 20 Nov 2025 03:36:19 GMT"}, {"title": "How to avoid bad Black Friday laptop deals – and some of the best UK offers for 2025", "summary": "Black Friday deals have started, and if you’ve been on the lookout for a good price on a new laptop, then this could be your lucky day. But with so many websites being shouty about their Black Friday offers, the best buys aren’t always easy to spot. Here’s how to spot a genuinely good laptop deal, plus the best discounts we’ have seen so far.", "link": "https://www.theguardian.com/thefilter/2025/nov/20/best-black-friday-laptop-deals-uk-2025", "source": "Technology | The Guardian", "publication_date": "Thu, 20 Nov 2025 17:44:34 GMT"}, {"title": "The 15 best tech gifts in the US, picked by a gadget reviewer who’s used hundreds", "summary": "Tech enthusiasts can be notoriously picky to buy for. From Apple AirPods to VR headsets, these are the tech gifts they’ll still be using years from now.", "link": "https://www.theguardian.com/thefilter-us/2025/nov/20/tech-gadget-gifts-ideas-guide", "source": "Technology | The Guardian", "publication_date": "Thu, 20 Nov 2025 15:48:23 GMT"}, {"title": "How to avoid bad Black Friday TV deals – and some of the best UK offers for 2025", "summary": "We've rounded up the best early Black Friday TV deals. From 50in OLEDs and small smart TVs to big-name brands like Samsung and LG.", "link": "https://www.theguardian.com/thefilter/2025/nov/20/best-black-friday-tv-deals-uk-2025", "source": "Technology | The Guardian", "publication_date": "Thu, 20 Nov 2025 12:46:40 GMT"}]}