{"language": "en", "news": [{"title": "Another Cloudflare outage takes down websites including LinkedIn and Zoom", "summary": "Web infrastructure provider says it has implemented a fix after users had seen ‘a large number of empty pages’ LinkedIn, Zoom and Downdetector went offline on Friday morning.", "link": "https://www.theguardian.com/technology/2025/dec/05/another-cloudflare-outage-takes-down-websites-linkedin-zoom", "source": "Technology | The Guardian", "publication_date": "Fri, 05 Dec 2025 10:58:47 GMT"}, {"title": "‘It was about degrading someone completely’: the story of Mr DeepFakes – the world’s most notorious AI porn site", "summary": "German journalist Patrizia Schlosser found fake images of herself online. She was naked, squatting, chained, performing sex acts with various animals. “They were very graphic, very humiliating,” she says.", "link": "https://www.theguardian.com/society/ng-interactive/2025/dec/05/it-was-about-degrading-someone-completely-the-story-of-mr-deepfakes-the-worlds-most-notorious-ai-porn-site", "source": "Technology | The Guardian", "publication_date": "Fri, 05 Dec 2025 05:00:42 GMT"}, {"title": "Home Office admits facial recognition tech issue with black and Asian subjects", "summary": "Home Office admits technology more likely to incorrectly identify black and Asian people than their white counterparts. Calls for review after technology found to return more false positives for ‘some demographic groups’ on certain settings.", "link": "https://www.theguardian.com/technology/2025/dec/05/home-office-facial-recognition-tech-issue-black-asian-subjects", "source": "Technology | The Guardian", "publication_date": "Fri, 05 Dec 2025 11:11:18 GMT"}, {"title": "Elon Musk’s X fined €120m by EU in first clash under new digital laws", "summary": "Elon Musk’s social media platform, X, has been fined €120m (£105m) It was found in breach of new EU digital laws. Ruling likely to put European Commission on collision course with billionaire, and possibly Donald Trump.", "link": "https://www.theguardian.com/technology/2025/dec/05/elon-musk-x-fined-eu-first-clash-under-new-digital-laws", "source": "Technology | The Guardian", "publication_date": "Fri, 05 Dec 2025 11:25:42 GMT"}, {"title": "Tesla launches cheaper version of Model 3 in Europe amid Musk sales backlash", "summary": "CEO Elon Musk says lower-cost electric car will reignite demand by appealing to broader range of buyers. Tesla has launched the lower-priced version of its Model 3 car.", "link": "https://www.theguardian.com/technology/2025/dec/05/tesla-cuts-model-3-price-europe-sales-elon-musk-backlash", "source": "Technology | The Guardian", "publication_date": "Fri, 05 Dec 2025 10:55:10 GMT"}, {"title": "Teens hoping to get around Australia’s social media ban are rushing to smaller apps. Where are they going?", "summary": "Australia is set to block under-16s from accessing 10 of its largest social media platforms. As Meta begins deleting accounts and the deadline looms, children have already begun to flock to platforms not included in the banned list. Less prominent companies have begun courting the teen market – in some cases paying underaged influencers to promote them.", "link": "https://www.theguardian.com/australia-news/2025/dec/04/under-16s-are-already-fleeing-to-apps-not-covered-by-australias-social-media-ban-heres-where-theyre-going", "source": "Technology | The Guardian", "publication_date": "Fri, 05 Dec 2025 02:11:23 GMT"}]}