{"language": "en", "news": [{"title": "Foreign interference or opportunistic grifting: why are so many pro-Trump X accounts based in Asia?", "summary": "X rolled out a new feature revealing the locations of popular accounts. The company was acting to boost transparency and clamp down on disinformation. The result has been a circular firing squad of recriminations.", "link": "https://www.theguardian.com/technology/2025/nov/27/pro-trump-x-twitter-accounts-based-in-asia", "source": "Technology | The Guardian", "publication_date": "Thu, 27 Nov 2025 00:01:12 GMT"}, {"title": "The 20+ best US Black Friday tech deals on TVs, tablets, phones, smart watches and more", "summary": "Black Friday and Cyber Monday is a great time to pick up some great deals. But it's also a chance to get some nice, deeply discounted goodies for yourself. This is especially true in the world of tech, where high prices and personal taste mean it's often just safest to buy what works for you.", "link": "https://www.theguardian.com/thefilter-us/2025/nov/19/best-black-friday-cyber-monday-tech-deals", "source": "Technology | The Guardian", "publication_date": "Thu, 27 Nov 2025 18:20:50 GMT"}, {"title": "The best Black Friday 2025 deals in the UK on the products we love, from electric blankets to sunrise alarms", "summary": "Black Friday has long since ceased to be a mere ‘day’ We’ve cut through the noise to find genuinely good discounts on Filter tried-and-tested products across home, tech, beauty and toys.", "link": "https://www.theguardian.com/thefilter/2025/nov/27/best-black-friday-deals-uk-2025-filter-tested-recommended", "source": "Technology | The Guardian", "publication_date": "Thu, 27 Nov 2025 16:23:15 GMT"}, {"title": "Don’t buy new tech this Black Friday: expert tips for buying refurbished phones and laptops", "summary": "It’s hard to escape the noise of retailers offering implausible-seeming Black Friday discounts on desirable technology. What they won’t be so keen to highlight is the huge environmental cost that comes from feeding the capitalist beast year on year. While the best approach for the planet is to opt out completely and observe the alternate holiday of Buy Nothing Day instead.", "link": "https://www.theguardian.com/thefilter/2025/nov/27/expert-tips-buying-refurbished-tech-phones-laptop-uk", "source": "Technology | The Guardian", "publication_date": "Thu, 27 Nov 2025 12:00:25 GMT"}]}