{"language": "en", "news": [{"title": "An AI-generated band got 1m plays on Spotify. Now music insiders say listeners should be warned", "summary": "The Velvet Sundown released two albums before admitting their music, images and backstory were created by AI. They went viral, amassing more than 1m streams on Spotify in a matter of weeks. The episode has triggered a debate about authenticity, with music industry insiders saying streaming sites should be legally obliged to tag music.", "link": "https://www.theguardian.com/technology/2025/jul/14/an-ai-generated-band-got-1m-plays-on-spotify-now-music-insiders-say-listeners-should-be-warned", "source": "Technology | The Guardian", "publication_date": "Mon, 14 Jul 2025 06:00:01 GMT"}, {"title": "Musk’s giant Tesla factory casts shadow on lives in a quiet corner of Germany", "summary": "Elon Musk advised Germans to vote for the far-right Alternative für Deutschland (AfD) in elections last year. Manu Hoyer wrote to the state premier of Brandenburg to complain. “How can you do business with someone who supports rightwing extremism?” she asked Dietmar Woidke.", "link": "https://www.theguardian.com/technology/2025/jul/14/musk-giant-tesla-factory-germany", "source": "Technology | The Guardian", "publication_date": "Mon, 14 Jul 2025 12:14:40 GMT"}, {"title": "Scientists reportedly hiding AI text prompts in academic papers to receive positive peer reviews", "summary": "Research papers found carrying hidden white text giving instructions not to highlight negatives as concern grows over use of large language models for peer review. Nikkei reported on 1 July it had reviewed research papers from 14 academic institutions in eight countries.", "link": "https://www.theguardian.com/technology/2025/jul/14/scientists-reportedly-hiding-ai-text-prompts-in-academic-papers-to-receive-positive-peer-reviews", "source": "Technology | The Guardian", "publication_date": "Mon, 14 Jul 2025 03:14:27 GMT"}, {"title": "Tangy kimchi, bad ice-cream and good eggs: my tests for the food filter have changed how I shop", "summary": "Tasting 10 supermarket staples for the food filter. Tasting everything from kimchi to mayonnaise – 70 products in all. Vanilla ice-cream was my least favourite: at least 50% of it was ultra-processed rubbish not even worthy of the name.", "link": "https://www.theguardian.com/thefilter/2025/jul/11/tangy-kimchi-bad-ice-cream-and-good-eggs-my-tests-for-the-food-filter-have-changed-how-i-shop", "source": "Technology | The Guardian", "publication_date": "Mon, 14 Jul 2025 14:00:10 GMT"}, {"title": "‘The way a child plays is the way they live’: how therapists are using video games to help vulnerable children", "summary": "Oleksii Sukhorukov's son was 12 when the Russian invasion of Ukraine began. His boy had one outlet: Minecraft. Whatever was happening outside, he’d boot up Mojang’s block-building video game and escape.", "link": "https://www.theguardian.com/games/2025/jul/14/the-way-a-child-plays-is-the-way-they-live-how-therapists-are-using-video-games-to-help-vulnerable-children", "source": "Technology | The Guardian", "publication_date": "Mon, 14 Jul 2025 09:00:04 GMT"}]}