{"language": "en", "news": [{"title": "Social media accounts of Palestinians desperate for funds are being flagged as spam", "summary": "People in Gaza use Bluesky to crowdfund for milk and diapers. repeated deletion of their profiles has spawned a guerrilla verification squad. Hanin Al-Batsh estimates she has signed up for more than 80 Bluesky accounts.", "link": "https://www.theguardian.com/technology/2025/aug/08/palestinians-gaza-bluesky-spam", "source": "Technology | The Guardian", "publication_date": "Fri, 08 Aug 2025 18:28:15 GMT"}, {"title": "Smartwatches offer little insight into stress levels, researchers find", "summary": "Academic study suggests devices cannot differentiate between someone being overworked and being excited. Smartwatches are supposed to monitor you throughout the working day. But a study has concluded that smartwatches cannot accurately measure your stress levels.", "link": "https://www.theguardian.com/technology/2025/aug/08/smartwatches-offer-little-insight-into-stress-levels-researchers-find", "source": "Technology | The Guardian", "publication_date": "Fri, 08 Aug 2025 16:10:16 GMT"}, {"title": "‘1 Progressive vs 20 Far-Right Conservatives’ – Mehdi Hasan on why he went on Surrounded", "summary": "Two-hour debate propelled Jubilee Media into the mainstream. Has been viewed 10m times, but some worry about the embrace of rage-fuelled content.", "link": "https://www.theguardian.com/technology/2025/aug/08/surrounded-show-jubilee-media-mainstream-has-it-succumbed-hateful-vitriol", "source": "Technology | The Guardian", "publication_date": "Fri, 08 Aug 2025 13:24:07 GMT"}, {"title": "When a journalist uses AI to interview a dead child, isn’t it time to ask what the boundaries should be? | Gaby Hinsliff", "summary": "Joaquin Oliver was 17 when he was shot in the hallway of his high school. An older teenager, expelled some months previously, had opened fire with a high-powered rifle. Seven years on, Joaquin says he thinks it’s important to talk about what happened on that day in Parkland, Florida.", "link": "https://www.theguardian.com/commentisfree/2025/aug/08/journalist-ai-interview-dead-child-joaquin-oliver", "source": "Technology | The Guardian", "publication_date": "Fri, 08 Aug 2025 06:00:01 GMT"}, {"title": "‘It’s not just football with blood’: Fear FA 98 is the Silent Hill meets Fifa 98 mashup we never knew we needed", "summary": "Fear FA 98 (pronounced Fear-fa, like Fifa) has you pulling out knives, rusty scissors and syringes, summoning demons and using decapitated heads as the ball. It's billed as ‘the world’s first online survival horror football game’", "link": "https://www.theguardian.com/games/2025/aug/08/its-not-just-football-with-blood-fear-fa-98-is-the-silent-hill-meets-fifa-98-mashup-we-never-knew-we-needed", "source": "Technology | The Guardian", "publication_date": "Fri, 08 Aug 2025 08:30:38 GMT"}]}