{"language": "en", "news": [{"title": "Demis Hassabis on our AI future: ‘It’ll be 10 times bigger than the Industrial Revolution – and maybe 10 times faster’", "summary": "Demis Hassabis is head of Google’s artificial intelligence arm, DeepMind. The 49-year-old was awarded the Nobel Prize for Literature in December. He says artificial intelligence could usher in an era of 'incredible productivity' and 'radical abundance'", "link": "https://www.theguardian.com/technology/2025/aug/04/demis-hassabis-ai-future-10-times-bigger-than-industrial-revolution-and-10-times-faster", "source": "Technology | The Guardian", "publication_date": "Mon, 04 Aug 2025 04:00:03 GMT"}, {"title": "George Osborne says UK has been left behind in cryptocurrency boom", "summary": "Ex-chancellor criticises hesitant approach to crypto and warns country in danger of missing next surge in market. Osborne, who has an advisory role at the crypto exchange firm Coinbase, said country already missed out on first generation of crypto.", "link": "https://www.theguardian.com/politics/2025/aug/04/george-osborne-uk-cryptocurrency-boom-left-behind", "source": "Technology | The Guardian", "publication_date": "Mon, 04 Aug 2025 15:14:49 GMT"}, {"title": "Social media battles and barbs on both sides of Atlantic over UK Online Safety Act", "summary": "Online Safety Act has become a rallying point for the right in Britain and the US. Rules were drawn up to force social platforms to protect children from posts and videos that incite hatred or encourage suicide, self-harm or eating disorders.", "link": "https://www.theguardian.com/technology/2025/aug/04/social-media-battles-and-barbs-on-both-sides-of-atlantic-over-uk-online-safety-act", "source": "Technology | The Guardian", "publication_date": "Mon, 04 Aug 2025 04:00:03 GMT"}, {"title": "The Tesla whistleblower and the cost of taking on Elon Musk - podcast", "summary": "Investigative journalist Sönke Iwersen's years-long investigation into Tesla. He was aided by a whistleblower, exposing serious safety concerns over the company's cars.", "link": "https://www.theguardian.com/news/audio/2025/aug/04/the-tesla-whistleblower-and-the-cost-of-taking-on-elon-musk-podcast", "source": "Technology | The Guardian", "publication_date": "Mon, 04 Aug 2025 02:00:56 GMT"}, {"title": "Parents, don’t panic – healthy screen time for children is possible, if you follow these few simple tips | Kaitlyn Regehr", "summary": "Technology secretary Peter Kyle announced he was considering a two-hour “screen time’ cap on children’s use of social media apps. Dr Kaitlyn Regehr is the programme director of digital humanities at University College London. She says the proposed cap addresses only the quantity of consumption, not the quality.", "link": "https://www.theguardian.com/commentisfree/2025/aug/04/parents-healthy-screen-time-children-tech-simple-tips", "source": "Technology | The Guardian", "publication_date": "Mon, 04 Aug 2025 09:00:04 GMT"}, {"title": "The Trolley Solution: the internet’s most memed moral dilemma becomes a video game", "summary": " Indie developer’s take on the ethical conundrum about choosing who to save from an oncoming train may be gimmicky, but with its charm and bite-size levels, it's ideal for the social media era. Originally formulated as a reflection on moral decision-making, the trolley problem found a second life in the 2010s.", "link": "https://www.theguardian.com/games/2025/aug/04/the-trolley-solution-the-internets-most-memed-moral-dilemma-becomes-a-video-game", "source": "Technology | The Guardian", "publication_date": "Mon, 04 Aug 2025 09:45:02 GMT"}]}