{"language": "en", "news": [{"title": "Linda Yaccarino stepping down as CEO of Elon Musk’s X", "summary": "Yaccarino announces she is leaving company after two years as chief executive officer The CEO of X, Elon Musk’s social network, announced on Wednesday she would resign. “After two incredible years, I’ve decided to step down as CEO of ,” Linda Yaccarino wrote.   Continue reading...", "link": "https://www.theguardian.com/technology/2025/jul/09/x-ceo-steps-down-linda-yaccarino", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 14:56:53 GMT"}, {"title": "UK government’s deal with Google ‘dangerously naive’, say campaigners", "summary": "Company to provide free technology and ‘upskill’ civil servants. Concerns raised over UK data being held on US servers.", "link": "https://www.theguardian.com/technology/2025/jul/09/uk-governments-deal-with-google-dangerously-naive-say-campaigners", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 15:42:34 GMT"}, {"title": "Nvidia becomes first company to reach $4tn in market value", "summary": "Shares of the top chip designer rose roughly 2.4% to $164, benefiting from the ongoing surge in demand for artificial intelligence technologies. Nvidia’s chips and associated software are considered world leaders for building artificial intelligence products.", "link": "https://www.theguardian.com/technology/2025/jul/09/nvidia-first-company-4-trillion", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 14:22:17 GMT"}, {"title": "Musk’s AI firm forced to delete posts praising Hitler from Grok chatbot", "summary": "Elon Musk’s artificial intelligence firm xAI has deleted ‘inappropriate’ posts on X. Bot began praising Adolf Hitler, referring to itself as MechaHitler and making antisemitic comments.", "link": "https://www.theguardian.com/technology/2025/jul/09/grok-ai-praised-hitler-antisemitism-x-ntwnfb", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 03:17:18 GMT"}, {"title": "Futurist Adam Dorr on how robots will take our jobs: ‘We don’t have long to get ready – it’s going to be tumultuous’", "summary": "Social scientist Adam Dorr says robots and artificial intelligence will dominate the global economy within a generation. Dorr heads a team of researchers who have studied patterns of technological change over millennia. He says the current wave will not just convulse but obliterate the labour market by 2045.", "link": "https://www.theguardian.com/technology/2025/jul/09/futurist-adam-dorr-robots-ai-jobs-replace-human-labour", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 04:00:42 GMT"}, {"title": "Sony WH-1000XM6 review: raising the bar for noise-cancelling headphones", "summary": "Upgraded Bluetooth cans fold up, fit well, have long battery life, sound great and reduce more noise than rivals. Sony 1000X series has long featured some of the best noise cancelling you can buy.", "link": "https://www.theguardian.com/technology/2025/jul/09/sony-wh-1000xm6-review-raising-the-bar-for-noise-cancelling-headphones", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 06:00:43 GMT"}, {"title": "‘I was nervous to ask for your socials’: why missed connection posts are making a comeback", "summary": "The popular Craigslist tradition is seeing a revival from Reddit and TikTok users. In the comments of a post  on the subreddit r/warpedtour, attendees of the punk rock and emo music festival searched for missed connections.", "link": "https://www.theguardian.com/lifeandstyle/2025/jul/09/missed-connection-posts-reddit-tiktok-craiglist", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 11:00:49 GMT"}, {"title": "The game developers striving to offer authenticity and inclusion in the face of AI", "summary": "Develop conference brings together developers, publishers, students and journalists. This year, after many months of cuts and closures, the mood has been dour. Several senior developers predicted that the recent savage cuts to staff numbers and game projects will lead to a gaping black hole in the release schedules of many triple-A publishers.", "link": "https://www.theguardian.com/games/2025/jul/09/in-the-industry-fight-against-ai-developers-are-striving-to-offer-authenticity-and-inclusion", "source": "Technology | The Guardian", "publication_date": "Wed, 09 Jul 2025 14:00:52 GMT"}]}