{"language": "en", "news": [{"title": "Uber loses UK supreme court appeal over tax on private-hire rivals", "summary": "Rival taxi operators will not face a 20% tax charge on their profit margins outside London. Court ruled that private-hire operators do not enter into a contract with passengers. Private-hire firms declared the verdict to be a ‘triumph for the sector’", "link": "https://www.theguardian.com/technology/2025/jul/29/uber-loses-uk-supreme-court-appeal-tax-taxi", "source": "Technology | The Guardian", "publication_date": "Tue, 29 Jul 2025 12:34:55 GMT"}, {"title": "As Australia’s teen social media ban looms, here’s how the platforms are lobbying for an exemption", "summary": " Meta, YouTube, TikTok and Snapchat are running ads and events saying their services are safe for children – with the possibility of a legal challenge. The Australian government will imminently announce which social media platforms will be included in the under-16s ban.", "link": "https://www.theguardian.com/media/2025/jul/29/social-media-ban-australia-tiktok-snapchat-youtube-meta-instagram-ntwnfb", "source": "Technology | The Guardian", "publication_date": "Tue, 29 Jul 2025 06:06:57 GMT"}, {"title": "CatVideoFest: how clips of cute kitties spawned a million-dollar movie franchise", "summary": "Every year since 2016, Will Braden has devoted himself to assembling a feature-length film from snippets of moggies doing the darndest things – and it has started to bring in serious money Name:  Cat videos. Age:  131.   Continue reading...", "link": "https://www.theguardian.com/lifeandstyle/2025/jul/29/catvideofest-clips-cute-cat-videos-movie-franchise-will-braden", "source": "Technology | The Guardian", "publication_date": "Tue, 29 Jul 2025 14:03:04 GMT"}, {"title": "Tales of the Shire: A Lord of the Rings Game review – too cosy for comfort", "summary": "Tales of the Shire is set in the Third Age of Middle-earth, years before the events of The Lord of the Rings. The ‘action’ centres on the quaint town of Bywater, whose most pressing issue is its municipal status. Here, you play as a recent transplant from the nearby hamlet of Bree, who gets swept up in the process of turning the town into an official village.", "link": "https://www.theguardian.com/games/2025/jul/29/tales-of-the-shire-a-lord-of-the-rings-game-review", "source": "Technology | The Guardian", "publication_date": "Tue, 29 Jul 2025 12:00:29 GMT"}, {"title": "Why did thousands of adult titles just disappear from the biggest PC gaming marketplaces?", "summary": "Steam and itch.io have tightened their rules about adult content – under pressure from payment processors. Thousands of ‘adult only’ and ‘not safe for work’ games have disappeared from the platforms.", "link": "https://www.theguardian.com/games/2025/jul/29/why-did-adult-titles-disappear-from-steam-itch-pc-gaming-payment-processors", "source": "Technology | The Guardian", "publication_date": "Tue, 29 Jul 2025 10:30:49 GMT"}]}