{"language": "en", "news": [{"title": "One in four unconcerned by sexual deepfakes created without consent, survey finds", "summary": "One in four people think there is nothing wrong with creating and sharing sexual deepfakes. Senior UK police officer says AI is accelerating violence against women and girls.", "link": "https://www.theguardian.com/technology/2025/nov/24/one-in-four-unconcerned-by-sexual-deepfakes-created-without-consent-survey-finds", "source": "Technology | The Guardian", "publication_date": "Mon, 24 Nov 2025 09:00:32 GMT"}, {"title": "‘Enshittification’: how we got the internet no one asked for – podcast", "summary": "Tech critic  Cory Doctorow explains why for so many the internet seems to be getting worse. He has a term to describe it too: ‘enshittification’", "link": "https://www.theguardian.com/news/audio/2025/nov/24/enshittification-how-we-got-the-internet-no-one-asked-for-podcast", "source": "Technology | The Guardian", "publication_date": "Mon, 24 Nov 2025 03:00:25 GMT"}, {"title": "Civil liberties groups call for inquiry into UK data protection watchdog", "summary": "Campaigners describe ICO ‘collapse in enforcement activity’ after Afghan data breach. 73 academics, senior lawyers, data protection experts and organisations including Statewatch and the Good Law Project, have written a letter to Chi Onwurah, the chair of the Commons science, innovation and technology committee.", "link": "https://www.theguardian.com/technology/2025/nov/24/civil-liberties-groups-call-for-inquiry-into-uk-data-protection-watchdog", "source": "Technology | The Guardian", "publication_date": "Mon, 24 Nov 2025 06:00:30 GMT"}, {"title": "Can’t tech a joke: AI does not understand puns, study finds", "summary": "Researchers say results underline large language models’ poor grasp of humour, empathy and cultural nuance. Experts from universities in the UK and Italy have been investigating whether large language model understand puns.", "link": "https://www.theguardian.com/technology/2025/nov/24/ai-doesnt-get-puns-study-finds", "source": "Technology | The Guardian", "publication_date": "Mon, 24 Nov 2025 07:59:34 GMT"}, {"title": "‘Extra challenging during a difficult time’: Robert Redford’s daughter criticises AI tributes to the late actor", "summary": "Amy Redford takes issue with ‘AI versions of funerals, tributes and quotes from members of my family that are fabrications’ Robert Redford’s daughter criticised the proliferation of artificial intelligence tributes to her father.", "link": "https://www.theguardian.com/film/2025/nov/24/extra-challenging-during-a-difficult-time-robert-redfords-daughter-criticises-ai-tributes-to-the-late-actor", "source": "Technology | The Guardian", "publication_date": "Mon, 24 Nov 2025 11:04:46 GMT"}, {"title": "The best Black Friday deals on the products we love, from sunrise alarm clocks to dehumidifiers", "summary": "Black Friday kicked off around Halloween and will run until 28 November. Some of the Filter’s favourite items are already floating around at prices clearly designed to make them sell out fast. Other deals won’t land until the big day itself on 28 November, or even until the daftly named Cyber Monday (1 December)", "link": "https://www.theguardian.com/thefilter/2025/nov/20/best-early-black-friday-deals-uk-2025-filter-tested", "source": "Technology | The Guardian", "publication_date": "Mon, 24 Nov 2025 12:56:27 GMT"}]}