{"language": "en", "news": [{"title": "US nuclear weapons agency ‘among 400 organisations breached by Chinese hackers’", "summary": "Microsoft says Chinese ‘threat actors’ have exploited vulnerabilities in its SharePoint document-sharing servers. Research indicates that several hundred government agencies and organisations have been breached.", "link": "https://www.theguardian.com/technology/2025/jul/23/sharepoint-targeted-by-chinese-threat-actor-hackers-says-microsoft", "source": "Technology | The Guardian", "publication_date": "Wed, 23 Jul 2025 14:39:08 GMT"}, {"title": "Samsung Galaxy Z Fold 7 review: the thinner, lighter and better folding Android", "summary": "Super-slim frame, improved display, enhanced camera and plenty of power give the pricey phone-tablet hybrid a major upgrade. The Galaxy Z Fold 7 measures 8.9mm thick when shut – well within the realms of a standard smartphone if you ignore the camera bump on the back. It easily fits in a pocket but opens up to turn into a folding tablet just 4.2mm thick.", "link": "https://www.theguardian.com/technology/2025/jul/23/samsung-galaxy-z-fold-7-android-review-thinner-lighter-better-folding", "source": "Technology | The Guardian", "publication_date": "Wed, 23 Jul 2025 06:00:45 GMT"}, {"title": "‘The only thing that gets me out of my tent’: the camping essentials you need (and what you don’t)", "summary": "Packing for a camping trip isn't easy, especially if you're not an experienced adventurer. Newbie campers often overpack while simultaneously leaving more useful items at home. From foam wash to hammocks, these are the non-negotiables seasoned campers swear by.", "link": "https://www.theguardian.com/thefilter/2025/jul/23/camping-essentials-uk", "source": "Technology | The Guardian", "publication_date": "Wed, 23 Jul 2025 14:11:07 GMT"}, {"title": "‘Pretty revolutionary’: a Brooklyn exhibit interrogates white-dominated AI to make it more inclusive", "summary": "Stephanie Dinkins challenges the racialized AI space by highlighting Black ethos and cultural cornerstones. A large screen displays artificial intelligence (AI) generated images that showcase the diversity of the city.", "link": "https://www.theguardian.com/artanddesign/2025/jul/23/stephanie-dinkins-ai-race-black-white-technology", "source": "Technology | The Guardian", "publication_date": "Wed, 23 Jul 2025 11:00:51 GMT"}, {"title": "How video games are keeping romance alive – one level at a time", "summary": "Last week, Radio 4's Woman's Hour talked about the role of women in the video games industry. It featured interviews with gaming insiders, from Frankie Ward to Black Girl Gamers. One of my favourite moments was when presenter Nuala McGovern read out some listener responses to the question: why do you play video games?", "link": "https://www.theguardian.com/games/2025/jul/22/pushing-buttons-video-games-romance-dating-sites-couples", "source": "Technology | The Guardian", "publication_date": "Wed, 23 Jul 2025 14:00:39 GMT"}]}