{"language": "en", "news": [{"title": "Australia’s world-first social media ban begins as millions of children and teens lose access to accounts", "summary": "Australia has enacted a world-first  ban on social media for users aged under 16. Millions of children and teenagers will lose access to their accounts. Facebook, Instagram, Threads, X, YouTube, Snapchat, Reddit, Kick, Twitch and TikTok are expected to have taken steps from Wednesday.", "link": "https://www.theguardian.com/australia-news/2025/dec/09/australia-under-16-social-media-ban-begins-apps-listed", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Dec 2025 13:01:04 GMT"}, {"title": "‘Don’t pander to the tech giants!’ How a youth movement for digital justice is spreading across Europe", "summary": "Gen Z are the first generation to have grown up with social media. They were the earliest adopters, and therefore the first to suffer its harms. Shanley Clémot McLaren was scrolling on her phone when she noticed a Snapchat post by her 16-year-old sister.", "link": "https://www.theguardian.com/media/2025/dec/09/youth-movement-digital-justice-spreading-across-europe", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Dec 2025 05:00:03 GMT"}, {"title": "EU opens investigation into Google’s use of online content for AI models", "summary": "European Commission to assess whether Gemini owner is putting rival companies at a disadvantage. Google is using online content from publishers and YouTube creators for artificial intelligence.", "link": "https://www.theguardian.com/technology/2025/dec/09/eu-investigation-google-ai-models-gemini", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Dec 2025 14:38:39 GMT"}, {"title": "‘I feel it’s a friend’: quarter of teenagers turn to AI chatbots for mental health support", "summary": "40% of 13- to 17-year-olds affected by youth violence are turning to AI chatbots for mental health support, according to research among more than 11,000 young people. Experts warn of dangers as England and Wales study shows young people consulting AI amid long waiting lists.", "link": "https://www.theguardian.com/technology/2025/dec/09/teenagers-ai-chatbots-mental-health-support", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Dec 2025 05:00:04 GMT"}, {"title": "Palantir: the world’s ‘scariest company’? – podcast", "summary": "Some consider Palantir the world’s ‘scariest company’ and who is its chief executive, Alex Karp. Michael Steinberger, the author of The Philosopher in the Valley, describes Karp's origin story to Nosheen Iqbal. Johana Bhuiyan, the editor-in-chief of The Guardian, talks to Steinberger about the company's close relationship to the US military.", "link": "https://www.theguardian.com/news/audio/2025/dec/09/palantir-the-worlds-scariest-company-podcast", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Dec 2025 03:00:55 GMT"}, {"title": "Trump clears way for Nvidia to sell powerful AI chips to China", "summary": "US Commerce department finalising deal to allow H200 chips to be sold to China as strict Biden-era restrictions relaxed Donald Trump has cleared the way for Nvidia to begin selling its powerful AI computer chips to China.", "link": "https://www.theguardian.com/technology/2025/dec/08/trump-nvidia-ai-chips-china", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Dec 2025 18:45:24 GMT"}, {"title": "Skate Story review – hellish premise aside, this is skateboarding paradise", "summary": "Skate Story is an exquisitely fluid game of tricks, grinds and manuals. framed by a story that uncovers the poignancy of the infamously painful pastime. It is the most emotionally real a skateboarding game has ever felt.", "link": "https://www.theguardian.com/games/2025/dec/09/skate-story-review-skateboarding", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Dec 2025 10:00:28 GMT"}]}