{"language": "en", "news": [{"title": "Impact of chatbots on mental health is warning over future of AI, expert says", "summary": "Nate Soares says case of US teenager Adam Raine highlights danger of unintended consequences in super-intelligent AI. Soares is a co-author of a new book on highly advanced AI titled If Anyone Builds It, Everyone Dies.", "link": "https://www.theguardian.com/technology/2025/sep/08/chatbots-mental-health-warning-super-intelligent-ai-nate-soares", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Sep 2025 05:00:42 GMT"}, {"title": "Facebook fiasco: why is Mark Zuckerberg suing Meta?", "summary": "His account kept being deactivated, even though he had spent thousands of dollars to use the social media site for advertising. Just one of the perils of sharing a name with the world-famous tech billionaire ... Name:  Mark Zuckerberg. Age:  Unknown.   Continue reading...", "link": "https://www.theguardian.com/technology/2025/sep/08/facebook-fiasco-why-is-mark-zuckerberg-suing-meta", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Sep 2025 16:22:22 GMT"}, {"title": "I got a robot massage and lived to tell the tale", "summary": "Megan Thee Stallion’s Mamushi is bumping from a speaker, and on a large screen, two white circles roam up and down an outline of my body. Am I at an exclusive German sex club at 2am?", "link": "https://www.theguardian.com/wellness/2025/sep/08/robot-massage-aescape-experience", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Sep 2025 16:00:49 GMT"}, {"title": "Are smartphones eroding the experience of watching football?", "summary": "In November 1980, I was 13 and making my way to Firhill from East Kilbride alone, arriving at the game to discover there was no manager in the dugout. It wasn't until the next day that I found out via the Sunday Mail that Bertie Auld had resigned and gone to Hibs. The news was devastating. Bertie was my first manager, in charge for all the years I’d been a supporter, all of them in the Premier League", "link": "https://www.theguardian.com/football/2025/sep/08/smartphones-eroding-experience-watching-football-phones-escapism-games-impatiece", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Sep 2025 12:05:33 GMT"}, {"title": "When maps go wrong: from the Great North Run to a phantom Aldi", "summary": "Great North Run organisers apologised for using a map of Sunderland, rather than Newcastle, on this year’s finisher medals. This was just one in a long line of map mistakes. Other blunders have included phantom supermarkets and dangerously misleading mountaineering routes.", "link": "https://www.theguardian.com/lifeandstyle/2025/sep/08/when-maps-go-wrong-from-the-great-north-run-to-a-phantom-aldi", "source": "Technology | The Guardian", "publication_date": "Mon, 08 Sep 2025 12:04:33 GMT"}]}