{"language": "en", "news": [{"title": "‘A million calls an hour’: Israel relying on Microsoft cloud for expansive surveillance of Palestinians", "summary": "Microsoft chief executive Satya Nadella met with the commander of Israel's military surveillance agency, Unit 8200. On the spy chief’s agenda: moving vast amounts of top secret intelligence material into the US company's cloud. The Israeli military undertook an ambitious project to store a giant trove of Palestinians’ phone calls on Microsoft's servers in Europe.", "link": "https://www.theguardian.com/world/2025/aug/06/microsoft-israeli-military-palestinian-phone-calls-cloud", "source": "Technology | The Guardian", "publication_date": "Wed, 06 Aug 2025 11:00:04 GMT"}, {"title": "The all-female rescue mission to Mars: my opera about a toxic tech bro takeover of the red planet", "summary": "Mars isn’t just a planet. It’s a philosophy, an ideology. The way humans think about it changes over time. Composer Jennifer Walshe reveals what fed into her epic opera, from low-gravity procreation to Shrek in space.", "link": "https://www.theguardian.com/music/2025/aug/06/all-female-rescue-mission-mars-opera-toxic-tech-bro-takeover-red-planet-jennifer-walshe-abbey", "source": "Technology | The Guardian", "publication_date": "Wed, 06 Aug 2025 04:00:47 GMT"}, {"title": "We’re being deafened by digital noise. Pause it and you hear the sound of democracy in crisis | Rafael Behr", "summary": "Vacation has become defined more by detachment from the digital realm than departure from home. The break begins not in a departure lounge but with the act of logging off.", "link": "https://www.theguardian.com/commentisfree/2025/aug/06/digital-democracy-crisis-politics-technological-change", "source": "Technology | The Guardian", "publication_date": "Wed, 06 Aug 2025 05:00:47 GMT"}, {"title": "China’s cyber-abuse scandal: is the government unwilling to crack down on exploitation of women online?", "summary": "Ming* found a hidden camera in her bedroom, wondering whether her boyfriend had placed it there to record memories of their \"happy life\" together. But hope quickly turned to horror. Ming’s boyfriend had been secretly taking sexually exploitative photos of not just Ming and her female friends, but also of other women in other locations.", "link": "https://www.theguardian.com/world/2025/aug/06/china-online-abuse-women-telegram-scandal-government", "source": "Technology | The Guardian", "publication_date": "Wed, 06 Aug 2025 00:32:13 GMT"}, {"title": "​Forever young? I’m another year older but I’ll never stop playing games - or writing about them", "summary": "My love for video games has never wavered, I have no intention of growing up and moving on. But at times like this, I think: maybe should I stop someday? Is there an upper limit on how long someone can do games journalism? I only know of a handful of people my age who are still writing about games on a full-time basis.", "link": "https://www.theguardian.com/games/2025/aug/05/forever-young-im-another-year-older-but-ill-never-stop-playing-games-or-writing-about-them", "source": "Technology | The Guardian", "publication_date": "Wed, 06 Aug 2025 14:01:06 GMT"}, {"title": "All-star lineup: Aphelion, a game made in collaboration with the European Space Agency", "summary": "Don’t Nod is the French studio behind Life Is Strange, Tell Me Why and Lost Records: Bloom and Rage. Since its founding in 2008, the company has made action-adventure games about memory, narrative games involving magical college students, and a role-playing game about a Georgian vampire. Recently, it released Jusant, an ecological sci-fi fable that was also a refreshingly realistic take on rock climbing.", "link": "https://www.theguardian.com/games/2025/aug/06/aphelion-a-game-european-space-agency-don-t-nod", "source": "Technology | The Guardian", "publication_date": "Wed, 06 Aug 2025 09:00:50 GMT"}]}