{"language": "en", "news": [{"title": "ChatGPT developing age-verification system to identify under-18 users after teen death", "summary": "OpenAI will restrict how ChatGPT responds to a user it suspects is under 18. System will default to the under-18 experience if there is doubt. Chief executive Sam Altman said ‘minors need significant protection’", "link": "https://www.theguardian.com/technology/2025/sep/17/chatgpt-developing-age-verification-system-to-identify-under-18-users-after-teen-death", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 06:05:06 GMT"}, {"title": "Temu’s UK operation doubles revenues and pre-tax profits", "summary": "Super-budget Chinese retailer reports revenues of $63.3m last year, almost double its $32m in 2023. UK operation of the Chinese online marketplace Temu doubled revenues and pre-tax profits.", "link": "https://www.theguardian.com/technology/2025/sep/17/temus-uk-operation-doubles-revenues-and-pre-tax-profits", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 11:44:38 GMT"}, {"title": "Trump celebrates TikTok deal as Beijing suggests US app would use China’s algorithm", "summary": "Donald Trump claims he has reached a deal with China to keep TikTok operating in the US. Comments from Chinese official in Madrid have raised questions over who could control the algorithm that powers Tik Tok’s video feed.", "link": "https://www.theguardian.com/world/2025/sep/17/trump-celebrates-tiktok-deal-as-beijing-suggests-us-app-would-use-chinas-algorithm", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 01:33:58 GMT"}, {"title": "Will Bartolo and Rae Colquhoun-Fairweather: the 10 funniest things we have ever seen (on the internet)", "summary": "Rae and Will are a clown duo who specialise in mime. They share what makes them laugh, including pop divas and unhinged mobile game ads.", "link": "https://www.theguardian.com/culture/2025/sep/18/will-bartolo-and-rae-colquhoun-fairweather-the-10-funniest-things-we-have-ever-seen-on-the-internet", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 15:00:19 GMT"}, {"title": "‘This is the hardest I’ve ever lived’: meet the US cowgirls making it as ranchers", "summary": "More women are entering the US ranching and agriculture field. Their struggles – and aspirations – defy the traditional Marlboro cowboy stereotype. Savanah McCarty was not riding across the wide-open prairie when a horse accident nearly killed her.", "link": "https://www.theguardian.com/us-news/2025/sep/17/cowgirl-ranching-women", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 15:00:16 GMT"}, {"title": "Sephora workers on the rise of chaotic child shoppers: ‘She looked 10 years old and her skin was burning’", "summary": "Jessica, 25, was working a shift at Sephora when a little girl who looked about 10 ran up to one of her colleagues, crying. “Her skin was burning,” Jessica said, “it was tomato red.”", "link": "https://www.theguardian.com/society/2025/sep/17/sephora-workers-child-skin-care", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 11:00:34 GMT"}, {"title": "Memes and nihilistic in-jokes: the online world of Charlie Kirk’s alleged killer", "summary": "Tyler Robinson, 22, shot and killed rightwing activist Charlie Kirk. Prosecutors say he texted his roommate to confess what he'd done. While appearing to admit to the murder, he pivoted to mention why he had carved messages into the ammunition.", "link": "https://www.theguardian.com/technology/2025/sep/17/charlie-kirk-suspect-online-memes", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 11:00:33 GMT"}, {"title": "Borderlands 4 review – the chaotic, colourful shooter has finally grown up a little", "summary": "Familiar and predictable, but also well-honed and significantly less juvenile, the fourth Borderlands game is a blast. It retains the distinctive cel-shaded graphical style and gun and ordnance-heavy gameplay that people have always loved. A decent storyline emerges after the formulaic first few hours, sending you off on some unexpected, fun and sometimes gratifyingly surreal tangents.", "link": "https://www.theguardian.com/games/2025/sep/17/borderlands-4-review-chaotic-colourful-shooter-grown-up", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 15:59:32 GMT"}, {"title": "Why random lines of video game dialogue get stuck in our heads", "summary": "From Street Fighter lines to quips from 90s classics, these are the quotes we hear again and again – and even incorporate into our own lives. Some snippets of video game dialogue are immediately recognisable to a swathe of fans. But there are also odd little phrases, sometimes from obscure games, that stick with us for seemingly no reason.", "link": "https://www.theguardian.com/games/2025/sep/17/video-game-dialogue-pushing-buttons", "source": "Technology | The Guardian", "publication_date": "Wed, 17 Sep 2025 14:00:16 GMT"}]}