{"language": "en", "news": [{"title": "‘The biggest decision yet’: Jared Kaplan on allowing AI to train itself", "summary": "Jared Kaplan is the chief scientist and co-owner of the $180bn (£135bn) US startup Anthropic. He said a choice was looming about how much autonomy the systems should be given to evolve.", "link": "https://www.theguardian.com/technology/ng-interactive/2025/dec/02/jared-kaplan-artificial-intelligence-train-itself", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 12:37:55 GMT"}, {"title": "Charlie Kirk tops Wikipedia’s list of most-read articles in 2025", "summary": "Wikipedia’s article on Charlie Kirk was the most read on the online encyclopedia this year. People viewed the entry on Kirk nearly 45m times, many after he was shot at a university campus debate. Zohran Mamdani, Ozzy Osbourne and Sinners also feature in encyclopedia's top 20 most-read English-language pages.", "link": "https://www.theguardian.com/technology/2025/dec/02/charlie-kirk-wikipedia-list-most-read-articles-in-2025", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 12:00:31 GMT"}, {"title": "The rise of deepfake pornography in schools: ‘One girl was so horrified she vomited’", "summary": "Hundreds of teachers have seen images created by pupils, often of their peers. The fallout is huge – and growing fast. ‘It worries me that it’s so normalised. He obviously wasn’t hiding it. It was in the open and people saw it.’", "link": "https://www.theguardian.com/society/ng-interactive/2025/dec/02/the-rise-of-deepfake-pornography-in-schools", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 10:00:28 GMT"}, {"title": "The fight to see clearly through big tech’s echo chambers", "summary": "As Silicon Valley tightens its grip on the narrative, insiders and regulators push back. Consumers rethink upgrades, and states experiment with AI in the public sector. Tips on avoiding the yearly smartphone upgrade cycle and new devices altogether.", "link": "https://www.theguardian.com/technology/2025/dec/01/big-tech-echo-chambers-silicon-valley", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 14:21:47 GMT"}, {"title": "The 15 best tech gifts in the US for moms, as requested by moms", "summary": "The best gift you can give a mom this holiday season is some time to herself. You don't have to be a techie to appreciate the utility, convenience and luxury of a thoughtful gizmo. From TheraGuns to koala breathing lights, here are good gizmos for mom.", "link": "https://www.theguardian.com/thefilter-us/2025/dec/02/best-tech-gifts-ideas-for-moms", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 15:52:54 GMT"}, {"title": "Datacentres demand huge amounts of electricity. Could they derail Australia’s net zero ambitions?", "summary": " Datacentres now draw about 2% of electricity from the National Grid, about 4 terawatt hours of power. That share is expected to rise rapidly – growing 25% year-on-year – to reach 12TWh, or 6% of grid demand, by 2030.", "link": "https://www.theguardian.com/australia-news/2025/dec/03/datacentres-demand-huge-amounts-of-electricity-could-they-derail-australias-net-zero-ambitions", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 14:00:38 GMT"}, {"title": "‘The Chinese will not pause’: Volvo and Polestar bosses urge EU to stick to 2035 petrol car ban", "summary": "Two Swedish car companies, Volvo and Polestar, are leading the campaign. They argue such a move is a desperate attempt to paper over the cracks in the German car industry.", "link": "https://www.theguardian.com/business/2025/dec/02/china-volvo-polestar-eu-2035-petrol-car-sweden-germany", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 06:00:19 GMT"}, {"title": "Metroid Prime 4: Beyond review – Samus Aran is suited up for action again. Was it worth the 18-year wait?", "summary": "Samus Aran, Nintendo’s coolest hero, is impeccably awesome. She is equipped here with new psychic powers that accent her suit with pulsing purple light. She transforms into a rolling ball, moves statues into place with her mind, and rides a futuristic shape-shifting motorcycle.", "link": "https://www.theguardian.com/games/2025/dec/02/metroid-prime-4-beyond-review-nintendo-samus-aran", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 15:56:15 GMT"}, {"title": "From Gears of War to Uno: the 15 most important Xbox 360 games", "summary": "As the Xbox 360 turns 20, we celebrate its most influential and memorable games – both exclusives, and those that came to the console first.", "link": "https://www.theguardian.com/games/2025/dec/02/the-15-most-important-xbox-360-games", "source": "Technology | The Guardian", "publication_date": "Tue, 02 Dec 2025 10:00:27 GMT"}]}