{"language": "en", "news": [{"title": "Nothing Headphone 1 review: attention-seeking design for your head", "summary": "London-based Nothing has designed a set of noise-cancelling headphones. The large, semi-transparent cans are certainly a statement piece on your head. The outer design covered in details, dot-matrix print and physical buttons.", "link": "https://www.theguardian.com/technology/2025/aug/13/nothing-headphone-1-review-bluetooth-noise-cancelling", "source": "Technology | The Guardian", "publication_date": "Wed, 13 Aug 2025 06:00:44 GMT"}, {"title": "Use of AI could worsen racism and sexism in Australia, human rights commissioner warns", "summary": "Lorraine Finlay says the pursuit of productivity gains from AI should not come at the expense of discrimination. Labor divided on how to respond to the emerging technology. Media and arts groups fear ‘rampant theft’ of intellectual property.", "link": "https://www.theguardian.com/technology/2025/aug/13/ai-artificial-intelligence-racism-sexism-australia-human-rights-commissioner", "source": "Technology | The Guardian", "publication_date": "Wed, 13 Aug 2025 06:05:08 GMT"}, {"title": "The secrets of the world’s richest company – podcast", "summary": "Nvidia is the richest company in the world, with a market value of $4tn. Created by Jensen Huang, a Taiwanese American, Nvidia is a microchip company with just 40,000 employees. Its products can be found in the games we play and ChatGPT.", "link": "https://www.theguardian.com/news/audio/2025/aug/13/secrets-worlds-richest-company-nvidia-podcast", "source": "Technology | The Guardian", "publication_date": "Wed, 13 Aug 2025 02:00:35 GMT"}, {"title": "Of course Mark Zuckerberg is still doing good works – he’s just switched up the definition of ‘good’ | Emma Brockes", "summary": "Mark Zuckerberg and his wife, Priscilla Chan, are discovered to have been running a private school out of their compound in Palo Alto, California, in violation of city zoning laws. The school of 14 kids, which includes two of the couple’s three daughters, is less than a mile from the school for low-income families that the couple founded in 2016.", "link": "https://www.theguardian.com/commentisfree/2025/aug/13/mark-zuckerberg-underprivileged-children-pickleball-president", "source": "Technology | The Guardian", "publication_date": "Wed, 13 Aug 2025 14:09:49 GMT"}, {"title": "A moment that changed me: I resolved to reduce my screen time – and it was a big mistake", "summary": "I was looking for liberation from the apps, but quitting them only made my life harder and turned me into a man obsessed. Some might suggest I would be better off learning to cook, or drive, or type with more than one finger, but they can’t reach me because I no longer look at my phone.", "link": "https://www.theguardian.com/lifeandstyle/2025/aug/13/a-moment-that-changed-me-i-resolved-to-reduce-my-screen-time-and-it-was-a-big-mistake", "source": "Technology | The Guardian", "publication_date": "Wed, 13 Aug 2025 05:55:40 GMT"}, {"title": "We know that cosy games have big audiences – so where’s my epic Call the Midwife sim?", "summary": "‘Cosy games’ have become a thriving cottage industry over the past five years. In a world overwhelmed by noise and with more players looking for solace, it’s time the triple-A developers pay attention. On Steam this month you’ll discover Catto's Post Office, Fruitbus and Tiny Bookshop.", "link": "https://www.theguardian.com/games/2025/aug/12/pushing-buttons-cosy-gaming", "source": "Technology | The Guardian", "publication_date": "Wed, 13 Aug 2025 14:00:22 GMT"}, {"title": "Silent Hill f – horror classic comes back to life in a fog-bound 60s town", "summary": "Silent Hill f is set in the fictional town of Ebisugaoka during the 1960s. Players are put into the dust-coated shoes of a misunderstood teenage girl named Hinako. Fleeing her drunk and abusive father, Hinako miserably roams the intricately rendered streets of her rural home town.", "link": "https://www.theguardian.com/games/2025/aug/13/silent-hill-f-horror-classic-hinako", "source": "Technology | The Guardian", "publication_date": "Wed, 13 Aug 2025 09:00:29 GMT"}]}