{
    "language": "en",
    "news": [
        {
            "title": "Demis Hassabis on our AI future: ‘It’ll be 10 times bigger than the Industrial Revolution – and maybe 10 times faster’",
            "summary": "The head of Google’s DeepMind says artificial intelligence could usher in an era of ‘incredible productivity’ and ‘radical abundance’. But who will it benefit? And why does he wish the tech giants had moved more slowly? If you have a mental image of a Nobel prizewinner, Demis Hassabis probably doesn’t fit it. Relatively young (he’s 49), mixed race (his father is Greek-Cypriot, his mother Chinese-Singaporean), state-educated, he didn’t exactly look out of place receiving his medal from the king of Sweden in December, amid a sea of grey-haired men, but it was “very surreal”, he admits. “I’m really bad at enjoying the moment. I’ve won prizes in the past, and I’m always thinking , ‘What’s the next thing?’ But this one was really special. It’s something you dream about as a kid.” Well, maybe not  you , but certainly him. Hassabis was marked out as exceptional from a young age – he was a chess prodigy when he was four. Today, arguably, he’s one of the most important people in the world. As head of Google DeepMind, the tech giant’s artificial intelligence arm, he’s driving, if not necessarily steering, what promises to be the most significant technological revolution of our lifetimes.   Continue reading...",
            "link": "https://www.theguardian.com/technology/2025/aug/04/demis-hassabis-ai-future-10-times-bigger-than-industrial-revolution-and-10-times-faster",
            "source": "Technology | The Guardian",
            "publication_date": "Mon, 04 Aug 2025 04:00:03 GMT"
        },
        {
            "title": "George Osborne says UK has been left behind in cryptocurrency boom",
            "summary": "Ex-chancellor criticises hesitant approach to crypto and warns country in danger of missing next surge in market Business live – latest updates The UK has been left behind in the cryptocurrency boom and is in danger of missing a second wave of demand, according to the former chancellor George Osborne. Osborne, who has an advisory role at the crypto exchange firm Coinbase, said the country already missed out on the first generation of crypto because the formerly sceptical US had embraced digital currencies under Donald Trump.   Continue reading...",
            "link": "https://www.theguardian.com/politics/2025/aug/04/george-osborne-uk-cryptocurrency-boom-left-behind",
            "source": "Technology | The Guardian",
            "publication_date": "Mon, 04 Aug 2025 10:05:25 GMT"
        },
        {
            "title": "Social media battles and barbs on both sides of Atlantic over UK Online Safety Act",
            "summary": "Farage accuses government of being ‘so below the belt’ as right wing doubles down on censorship claims  The UK’s  Online Safety Act  has been greatly anticipated. Amid mounting concerns about the ease of accessing harmful content online, rules were drawn up to force social platforms to protect children from posts and videos that incite hatred or encourage suicide, self-harm or eating disorders. But within days of coming into force, the new approach to keeping children safe online had become a rallying point for the right in both Britain and the US.   Continue reading...",
            "link": "https://www.theguardian.com/technology/2025/aug/04/social-media-battles-and-barbs-on-both-sides-of-atlantic-over-uk-online-safety-act",
            "source": "Technology | The Guardian",
            "publication_date": "Mon, 04 Aug 2025 04:00:03 GMT"
        },
        {
            "title": "The Tesla whistleblower and the cost of taking on Elon Musk - podcast",
            "summary": "Investigative journalist Sönke Iwersen describes his years-long investigation into Tesla, aided by a whistleblower, exposing serious safety concerns over the company’s cars In November 2022, a whistleblower contacted investigative journalist  Sönke Iwersen . He could not give his name, he said, but he had access to huge amounts of data about Tesla, his former employer: private phone numbers, social security information, bank statements, documents stamped ‘top secret’, and much, much more.   Continue reading...",
            "link": "https://www.theguardian.com/news/audio/2025/aug/04/the-tesla-whistleblower-and-the-cost-of-taking-on-elon-musk-podcast",
            "source": "Technology | The Guardian",
            "publication_date": "Mon, 04 Aug 2025 02:00:56 GMT"
        },
        {
            "title": "Parents, don’t panic – healthy screen time for children is possible, if you follow these few simple tips | Kaitlyn Regehr",
            "summary": "Yes, the huge firms pushing unsuitable content must be regulated. But until they are, adults can model the positive use of tech Dr Kaitlyn Regehr is the programme director of digital humanities at University College London This summer the technology secretary, Peter Kyle, announced  he was considering  a two-hour “screen time” cap on children’s use of social media apps – a proposal that is not just insufficient, it’s outdated. Though appropriately placed at the start of the summer holiday – a time when kids’ screen time can increase, along with the onus on parents to ensure the safety of such engagement – Kyle’s announcement is linked to somewhat stale screen time guidance. We should indeed be thinking about moderating time on screens, but the proposed cap addresses only the quantity of consumption, not the quality. Fortunately, as someone who lectures on digital literacy (and is a mother), I can tell you there are some ways to push back and create healthier habits for children this summer – even if the government doesn’t seem to have caught up with them yet. For younger children, time off screens is generally better than on. However, when we do use screens, I encourage my own children to watch live TV on platforms such as CBeebies and CBBC, as this provides a diversity of content curated by a children’s programmer. Lots of time and advocacy has gone into producing it. Prioritise active and engaged viewing over passive viewing. This means content that encourages creativity and discussion. This supports active brain engagement, learning and communication skills. It’s often better to opt for collective over solitary viewing, which can act as a springboard for discussion and build critical thinking and social engagement skills. Begin seeding critical thinking about digital content from an early age. You can input questionable images into platforms such as  Sightengine , and they will tell you how likely each image is to be fake. This is a great way to start conversations about disinformation online. Speak to older children about what they want their digital diet to look like. Together, dedicate half an hour a week to training the machine learning by actively searching for positive content – content that they are passionate about or that makes them feel good. Don’t watch uninteresting, uninspiring content or content that makes them (or you) feel bad. Quickly move past it. And teach them not to like, share things or comment on things that they don’t like. Even  commenting on something  you don’t like counts as engagement, meaning you may get more of it. As a family, do an “uninspiring” clean. If it no longer inspires or educates you, unfollow it. This includes exes, TV personalities and brands. Do this regularly to clean up your feed and narrow in on what you do want to see. To combat targeted advertising, there are some Google alternatives you might want to look at as a family. DuckDuckGo or Firefox Focus are search engines that do not track you to serve targeted ads. You could also look at  Startpage , which allows you to use Google without tracking your digital footprint. Dr Kaitlyn Regehr is the programme director of digital humanities at University College London, lecturing on digital literacy and the ethical implications of social media and AI. She is also the author of  Smartphone Nation : Why We’re All Addicted to Screens and What You Can Do About It   Continue reading...",
            "link": "https://www.theguardian.com/commentisfree/2025/aug/04/parents-healthy-screen-time-children-tech-simple-tips",
            "source": "Technology | The Guardian",
            "publication_date": "Mon, 04 Aug 2025 09:00:04 GMT"
        },
        {
            "title": "The Trolley Solution: the internet’s most memed moral dilemma becomes a video game",
            "summary": "Indie developer’s take on the ethical conundrum about choosing who to save from an oncoming train may be gimmicky, but with its charm and bite-size levels, it’s ideal for the social media era In 1967, British philosopher Philippa Foot unwittingly created one of the internet’s most regurgitated memes. A runaway train is hurtling towards five people tied to the tracks. You can pull a lever to divert the train to a different track to which only one person is tied. Do you intervene to kill the one and spare the five? What if one of the tracks twisted into a really cool loop-the-loop? Or the trolley was replaced by a bloodthirsty Thomas the Tank Engine? Or the whole dilemma was clumsily altered to comment on the political controversy of the day? Originally formulated as a reflection on moral decision-making, the trolley problem found a second life in the 2010s as a well of inspiration for variously silly, irreverent and self-referential trolley-based memes. Now, it may be entering its third era as surreal interactive comedy game The Trolley Solution.   Continue reading...",
            "link": "https://www.theguardian.com/games/2025/aug/04/the-trolley-solution-the-internets-most-memed-moral-dilemma-becomes-a-video-game",
            "source": "Technology | The Guardian",
            "publication_date": "Mon, 04 Aug 2025 09:45:02 GMT"
        }
    ]
}