{"language": "en", "news": [{"title": "ChatGPT firm blames boy’s suicide on ‘misuse’ of its technology", "summary": "OpenAI responds to lawsuit claiming its chatbot encouraged California teenager to kill himself. Family of Adam Raine, 16, filed lawsuit against company and its chief executive, Sam Altman.", "link": "https://www.theguardian.com/technology/2025/nov/26/chatgpt-openai-blame-technology-misuse-california-boy-suicide", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 15:31:58 GMT"}, {"title": "European parliament calls for social media ban on under-16s", "summary": "MEPs pass resolution to help parents tackle growing dangers of addictive internet platforms. Although not legally binding, it raises pressure for European legislation. Growing alarm about  mental health risks to children of unfettered internet access.", "link": "https://www.theguardian.com/technology/2025/nov/26/social-media-ban-under-16s-european-parliament-resolution", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 16:28:31 GMT"}, {"title": "London councils enact emergency plans after three hit by cyber-attack", "summary": "Royal Borough of Kensington and Chelsea (RBKC), and Westminster city council, which share some IT infrastructure, said a number of systems had been affected across both authorities. Hammersmith and Fulham also reports hack.", "link": "https://www.theguardian.com/technology/2025/nov/26/london-councils-kensington-and-chelsea-westminster-cyber-attack-emergency", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 16:34:05 GMT"}, {"title": "Computer maker HP to cut up to 6,000 jobs by 2028 as it turns to AI", "summary": "US firm says plan to speed up product development and improve customer satisfaction would save $1bn a year. Announcing a lower-than-expected profit outlook for the coming year.", "link": "https://www.theguardian.com/business/2025/nov/26/computer-maker-hp-to-cut-up-to-6000-jobs-by-2028-as-it-turns-more-to-ai", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 14:53:31 GMT"}, {"title": "Warner Music signs deal with AI song generator Suno after settling lawsuit", "summary": "Warner Music has signed a licensing deal with artificial intelligence song generator Suno. Music company representing Coldplay and Ed Sheeran had sued tech platform alleging mass copyright infringement.", "link": "https://www.theguardian.com/business/2025/nov/26/warner-music-signs-deal-with-ai-song-generator-suno-after-settling-lawsuit", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 10:27:15 GMT"}, {"title": "The best robot vacuums in the UK to keep your home clean and dust free, tested", "summary": "Robot vacuum cleaners take the drudge work out of cleaning your floors and carpets. Over the past few years, robot vacuums have become much more affordable, with basic units starting at about £150. They’re also doing more than they used to, mopping areas of hard flooring and charging in sophisticated cleaning stations that empty their dust collectors and clean their mop pads.", "link": "https://www.theguardian.com/thefilter/2024/nov/26/best-robot-vacuum-mop", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 10:00:21 GMT"}, {"title": "T​he era-defining Xbox 360 ​reimagined ​gaming​ and Microsoft never matched it", "summary": "Two decades on, its influence still lingers, marking a moment when gaming felt thrillingly new again. In 2001, the first Xbox had muscled in on a scene dominated by Japanese consoles. It turned Xbox from an upstart into a market leader.", "link": "https://www.theguardian.com/games/2025/nov/26/how-the-xbox-360-almost-won-the-console-war", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 15:00:28 GMT"}, {"title": "Kirby Air Riders review – cute pink squishball challenges Mario for Nintendo racing supremacy", "summary": "Kirby Air Riders is the unexpected sequel to a critically panned 2003 GameCube game. With no Grand Prix to compete in, in the game's titular mode you choose a track and compete to be the first of six players to cross the finish line.", "link": "https://www.theguardian.com/games/2025/nov/26/kirby-air-riders-review-nintendo", "source": "Technology | The Guardian", "publication_date": "Wed, 26 Nov 2025 10:00:48 GMT"}]}