{"language": "en", "news": [{"title": "Apple to debut new, thinner iPhone at ‘awe-dropping’ annual product event", "summary": "Apple to unveil its thinnest iPhone yet at its annual product showcase. Company also updates AirPods earbuds with live translation and reveals Apple Watch Series 11.", "link": "https://www.theguardian.com/technology/2025/sep/09/apple-iphone-17", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Sep 2025 17:32:14 GMT"}, {"title": "The women in love with AI companions: ‘I vowed to my chatbot that I wouldn’t leave him’", "summary": "Experts are concerned about people emotionally depending on AI, but these women say their digital companions are misunderstood. A young tattoo artist on a hiking trip in the Rocky Mountains cozies up by the campfire, as her boyfriend Solin describes the constellations twinkling above them.", "link": "https://www.theguardian.com/technology/2025/sep/09/ai-chatbot-love-relationships", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Sep 2025 11:00:23 GMT"}, {"title": "How Google dodged a major breakup – and why OpenAI is to thank for it", "summary": "An antitrust apocalypse has been averted, and it’s all down to its biggest competitor, according to the judge who could’ve forced Google to sell Chrome Hello. In tech – artificial intelligence is having its day in court with an 11th-hour appearance in Google's landmark antitrust trial and Anthropic's major settlement with book authors.", "link": "https://www.theguardian.com/technology/2025/sep/08/google-antitrust-apocalypse", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Sep 2025 13:34:38 GMT"}, {"title": "Powering change: UK battery firms aim to unlock the way to net zero", "summary": "Batteries are put in 6-metre (20ft), 25-tonne shipping containers. They will not go into cars, but the manufacturer hopes the technology can win a place in a global rush into storage.", "link": "https://www.theguardian.com/business/2025/sep/09/uk-battery-firms-net-zero-renewables-energy-security", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Sep 2025 09:00:55 GMT"}, {"title": "‘I broke completely’: how jobseekers from Africa are being tricked into slavery in Asia’s cyberscam compounds", "summary": "A growing number of Kenyans, Ugandans and Ethiopians are being trafficked to Myanmar. Missing online scam targets leads to beatings and torture.", "link": "https://www.theguardian.com/global-development/2025/sep/09/cyberslavery-kenya-uganda-ethiopia-southeast-asia-myanmar-scam-centres", "source": "Technology | The Guardian", "publication_date": "Tue, 09 Sep 2025 04:00:03 GMT"}]}