{"language": "en", "news": [{"title": "AI tools used by English councils downplay women’s health issues, study finds", "summary": "LSE research finds risk of gender bias in care decisions made based on AI summaries of case notes. Language such as ‘disabled’, ‘unable’ and ‘complex’ appeared significantly more often in descriptions of men than women.", "link": "https://www.theguardian.com/technology/2025/aug/11/ai-tools-used-by-english-councils-downplay-womens-health-issues-study-finds", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 05:00:42 GMT"}, {"title": "Wikipedia can challenge Online Safety Act if strictest rules apply to it, says judge", "summary": "Wikimedia Foundation says it will be forced reduce access to site if it is classified as a category 1 provider by Ofcom. High court judge gives foundation permission to challenge the Online Safety Act.", "link": "https://www.theguardian.com/society/2025/aug/11/wikipedia-can-challenge-online-safety-act-strictest-rules-high-court", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 12:15:42 GMT"}, {"title": "End of an era: AOL to discontinue its dial-up internet service after 30 years", "summary": "The hisses, pings and screeches that introduced millions of Americans to the online world will be retired in September. AOL, or America Online, said  recently it was discontinuing the old school connection option.", "link": "https://www.theguardian.com/us-news/2025/aug/11/aol-dial-up-internet", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 15:32:19 GMT"}, {"title": "Cat soap operas and babies trapped in space: the ‘AI slop’ taking over YouTube", "summary": "Nearly one in 10 of the fastest growing YouTube channels globally consist of mass-produced, surreal AI-generated videos. Super Cat League (3.9 million subscribers), LSB POWER GAMING (1.7 million subscribers) and MIRANHAINSANO (4.9million subscribers)", "link": "https://www.theguardian.com/technology/2025/aug/11/cat-soap-operas-and-babies-trapped-in-space-the-ai-slop-taking-over-youtube", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 11:00:03 GMT"}, {"title": "Nvidia and AMD agree to pay 15% of China chip export revenues to US", "summary": "Unprecedented deal, an apparent reversal of security restrictions, is in return for licences to sell to China. Nvidia and AMD have agreed to give the US government 15% of their revenue from advanced chips sold to China in exchange for export licences.", "link": "https://www.theguardian.com/technology/2025/aug/10/nvidia-amd-china-chip-sale-revenues", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 11:35:44 GMT"}, {"title": "I want my faulty earbud fixed. Should it cost less than replacing the pair?", "summary": "With a growing e-waste problem, you’re right to pursue a repair, writes policy professional Kat George. Your consumer rights extend beyond a product’s warranty too.", "link": "https://www.theguardian.com/lifeandstyle/2025/aug/12/i-want-my-faulty-earbud-fixed-should-it-cost-less-than-replacing-the-pair", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 15:00:10 GMT"}, {"title": "Tiny Bookshop review – a truly cosy escape made with readers in mind", "summary": "Tiny Bookshop is a resource management simulator set in a retail or service environment. Real titles from Shakespeare to John Green line the shelves of your seaside shop in a rhythmic, mellow management simulator.", "link": "https://www.theguardian.com/games/2025/aug/11/tiny-bookshop-review", "source": "Technology | The Guardian", "publication_date": "Mon, 11 Aug 2025 09:00:48 GMT"}]}